{
  "author": "sageadmin",
  "approver": "bryan.shirota@sage.com",
  "attributeSetName": null,
  "attributes": [],
  "categoryCode": "custom",
  "collections": [
    "custom_au_en_threehundredcre",
    "custom_ca_threehundred_construction",
    "custom_us_threehundred_construction"
  ],
  "createDate": 1682979430000,
  "diagnosticResponses": [],
  "fields": [
    {
      "name": "Description",
      "content": ""
    },
    {
      "name": "Cause",
      "content": "<div style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\" data-mce-style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\"><br></div>"
    },
    {
      "name": "Resolution",
      "content": "<span class=\"ra-content-caution\" style=\"color: #b94a48;\"><img src=\"https://internal-kb.sage.com/portal/app/images/content_caution.gif\" alt=\"\" /> <strong>CAUTION:</strong> <span>Use caution when working with the below product functionality. Always create a backup of your data before proceeding with advanced solutions. If necessary, seek the assistance of a qualified Sage business partner, network administrator, or Sage customer support analyst.</span></span><br><span class=\"ra-content-caution-1 mceNonEditable\" style=\"color: #b94a48;\"><span><img class=\"ra-att-img\" src=\"https://internal-kb.sage.com/portal/app/images/content_caution.gif\" alt=\"\" width=\"18px\" height=\"17px\" />&nbsp;<strong class=\"ra-att-title\">CAUTION:</strong> This solution requires advanced knowledge of Windows security and network settings. Sage isn't responsible for any issues that arise from changes to these settings. Ensure you back up all system and application databases necessary for a complete restoration. It's advisable to contact a certified consultant or your system administrator for assistance.</span></span><br><br></p><div style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\" data-mce-style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\">Refer to the User's Guide for more information. The User's guide is located on the Product Documentation webpage and can be found at <a title=\"Product Documents\" rel=\"noopener\" href=\"http://cdn.na.sage.com/SageMail/zCREDocs/CREDocs.html\" target=\"_blank\" data-mce-href=\"http://cdn.na.sage.com/SageMail/zCREDocs/CREDocs.html\"><span style=\"color: #ff5800;\" data-mce-style=\"color: #ff5800;\">Product Documents</span></a><p><br></p><p><strong>Warning:</strong> When moving data, do not copy the data folders to non-UAC compliant locations such as C:\\Program Files\\ or C:\\Program Files (x86)\\. Please read the User's Guid for more information on UAC compliant Locations.</p><p><strong>Note:</strong> The Sage Migration Tool only works on versions <strong>9.8 Accounting Update 6.3</strong> and higher. If the new server is on <strong>9.8</strong>, you must install <strong>update 6.3</strong> prior to running the Sage Migration Tool. On versions <strong>12.1 </strong>and above, no updates are required. You must run the <strong>Sage.STO.ServerMigrator.exe</strong> prior to running the <strong>Sage.STO.ServerDataMigrator.exe</strong>.</p><p><strong>Things to know before you begin migrating your data:</strong></p><ul><li>You must first install Sage 300 Construction and Real Estate Accounting on your new server to access the server migration tool.</li><li>You must have administrative rights to the new server and a minimum of read permission to the old server.</li><li>Ensure that your new server has enough disk space to hold the information from the old server.</li><li>Most of the migration tasks are performed in a few minutes. However, moving attachments can take more time. If you have a large number of attachments, consider transferring them during non-business hours.</li><li>Estimating and Sage Paperless Construction are not included in the migration tool. See linked KBs below for information on those products.</li><li><em>For versions 17.1 and later</em>, in order to use the new online entitlement, you will need to know your <strong>Company ID </strong>and <strong>Registration Name</strong>. When upgrading from prior version, we attempt to prefill this information for you.<ul><li>For new installations, or if this information does not prefill automatically, please refer to [[How do I find my Registration Name &amp; Account ID?|225924450086829]]</li></ul></li><li>We recommend that you perform a test migration, then validate that all of your data, reports, macros and settings work properly on the new server. You can then stop work on the old server and perform the migration again with the latest files.<ul><li>Please see [[Install Sage 300 Construction and Real Estate 17.1.5 and later on a test server|225924450087125]]<strong> </strong>before proceeding with a test server in 17.5 or later</li></ul></li><li><p>Set up existing or new printers on your new server. The TS PDF printer cannot be the only printer on your system and cannot be selected as the default.</p></li><li><p>All users must be out of the software in order to perform the migration.</p></li><li><p>The migration will overwrite companies and security on the new server. You should perform the migration first, then set up companies and security (for example, if you start a new job).</p></li></ul><p><strong>Note: </strong>If the drive mapping to Accounting and Management Products on the server changes at the workstation, then the link to custom reports no longer works. To resolve the issue, update the path specified for your custom reports in Reports Manager from the Reports menu of the appropriate applications or the path noted in File Locations.</p><p>If you are using <strong>File Locations</strong> (<strong>TS-Main</strong>, <strong>File, Company Settings, File Locations</strong> or v16.1 and higher: <strong>Desktop</strong>, <strong>Applications</strong>, <strong>Common Tasks</strong>, <strong>File, Company Settings, File Locations</strong>) and the path to the file points to the old server location (UNC or by Mapped Drive), you should update this path to a <strong><u>UNC PATH</u></strong> prior to upgrading your data on the new server. During a data upgrade, the program follows the path selected in File Locations to upgrade the data file. <strong>If that path is the old location, data files in the old location/server/<u>Live Server (If this is a test migration)</u> are upgraded instead of data in the new location/server. </strong></p><p><strong>Important Considerations:</strong></p><ul><li>If you have applied any patches or updates to Sage 300 Construction and Real Estate, you must reapply those updates after migration.</li><li>If you have Sage Estimating on the destination machine, uninstall Sage Estimating before Sage 300 Construction and Real Estate Accounting will install. Estimating products may be reinstalled after Sage 300 Construction and Real Estate Accounting products have been installed successfully.</li><li>Validate that you have enough drive space on the new server to install. Sage 300 Construction and Real Estate installs various files to the same drive location as the ProgramData folder, typically the C: drive. You must have at least 4 GB of space available on this drive to install Sage 300 Construction and Real Estate. We recommend that you check the current size of your 9.5 folder and double it.</li><li>Only macros at the root of the company folder will be migrated.</li><li>IF going to <strong>17.1 Rev 5</strong> or HIGHER, you must first Run File Doctor on the data before using migration tools to migrate to the new server.</li><li>IF going to <strong>17.1 Rev 5</strong> or HIGHER - activation codes are populated and activated in the License Admin tool on server BEFORE correcting File Locations and then upgrading data. AcctActivation file is no longer used.</li></ul><p><strong>A. Install Sage 300 Construction and Real Estate </strong><strong>at</strong><strong> the new server with the CD or download used for your current installation:</strong></p><ol><li>If you are on version 17.1 Rev 5 or higher, in the License Administration app on the old server, click <strong>Deauthorize Server</strong> to make the licenses available to the new server.</li><li>Install Sage 300CRE at the new server with the installation download.</li><li>Enter your registration name, client number, software country, number of uses, and activation codes, <em>not version 17.1 Rev 5 or Higher</em> (see bullet above)<p><strong>Note:</strong> Version <strong>17.1 Rev 3 OR lower </strong>You can use the AccActivation.xml file in the Wininst folder of the old Server to prefill the number of users, and activation codes, see [[How to prefill activation codes during the installation of Sage 300 Construction and Real Estate version 17.1 Rev 3 and lower?|221924360114695]]</p></li><li>Complete the installation as usual. For more information, see Installation Guide. It is located in the installation download under <strong>Documents</strong>.</li></ol><p><strong>B. Move/Migrate the Accounting and Management Products using the Sage 300 Construction and Real Estate Server Migration Tool:</strong></p><p><strong><em>Note: </em></strong><em>If you are migrating from 300CRE version 14.1 and Earlier, to 15.1/16.1, please see</em> [[Error: \"Could not find a part of the path '\\\\[serversname]\\Timberline Office\\9.5\\Accounting\\WordIntegration\\UserTemplate.\"|224924750069462]] before beginning the Server Migration Tool.</p><ol><li>To launch the migration tool on the new server, browse to the ..\\Timberline Office\\Shared folder (typically located in <strong>C:\\Program Files (x86)\\Timberline Office\\Shared</strong>) and run the <strong>Sage.STO.ServerMigrator.exe</strong> program from your new server.</li><li>Enter the path to the <strong>9.5</strong> folder on the old server, or click <strong>Browse</strong> and locate/select the <strong>9.5</strong> folder on the old server.<p><strong>Note:</strong> This is the <strong>Application Data Directory</strong> which can be located on the old server by opening Timberline and accessing the Help menu and selecting About <em>the application</em> or by opening your Registry Editor and browsing to <strong>HKEY_LOCAL_MACHINE\\SOFTWARE\\Timberline\\General (or HKEY_LOCAL_MACHINE\\SOFTWARE\\Wow6432Node\\Timberline\\General</strong> on a 64-bit machine).</p></li><li>Select the <strong>Migrate</strong> button - Validation of the old server location, new server location, and log file path will complete and then the appropriate contents of the 9.5 folder will be copied to the new server.<p><strong>Note</strong>: You can select the <strong>Validate</strong> button first to validate the paths before or instead of migrating them.</p></li><li>Select the <strong>Close</strong> button when complete.</li><li>Review the <strong>Server Migration Log</strong> (typically located \\\\[servername]\\Timberline Office\\9.5\\Accounting\\Migration\\ServerMigrationLog.pdf) to review the material that migrated.</li></ol><p><strong>C. Move/Migrate data folders using the Sage 300 Construction and Real Estate Server Data Migration Tool.</strong></p><ol><li>Browse to the <strong>C:\\Program Files (x86)\\Timberline Office\\Shared</strong> folder and run the <strong>Sage.STO.ServerDataMigrator.exe</strong> program from the new server.</li><li>Select the Company(ies) that you want to migrate by checking the box in the Select column.</li><li>Verify the destination location.<p><strong>Note:</strong> You can change the location by typing in a different path or clicking on <strong>Browse</strong>, but the last subfolder of the New data folder must be the same as the last subfolder of the Old data folder and must be in a User Access Control (UAC) compliant location.</p></li><li>Select <strong>Validate</strong> to confirm access to the old location and the validity of the new location.<p><strong>Note:</strong> This step is optional as the system will validate when you click on <strong>Migrate data folders</strong>.</p></li><li>Select <strong>Migrate data folders</strong>. The system will copy the company folders and you will see a progression bar.</li><li>Review the <strong>ServerDataMigrationLog</strong> to confirm a successful move.</li><li>Select <strong>Close</strong> when done or move on to <strong>Migrate macros</strong> or <strong>Migrate attachments</strong>.</li></ol><p><strong>D.</strong> <strong>Migrate macros using the Sage 300 Construction and Real Estate Server Data Migration Tool. (Optional)</strong></p><div style=\"margin-left: 2em;\" data-mce-style=\"margin-left: 2em;\"><ol><li>Browse to the ..\\Timberline Office\\Shared folder and run the <strong>Sage.STO.ServerDataMigrator.exe</strong> program, if not already open from the previous section.</li><li>Select the Company(ies) that you want to migrate by checking the box in the Select column.</li><li>Select <strong>Migrate macros</strong>.</li><li>In the <strong>Server Data Migration - Macro Printers</strong> window click on <strong>Change</strong> to specify the printer you want to use after the migration. This could the same printer as before or you can choose a different printer.</li><li>Select <strong>Migrate macros</strong> to complete the update.</li><li>Review the <strong>ServerDataMigrationLog</strong> to confirm a successful move.</li><li>Select <strong>Close</strong> when done or move on to <strong>Migrate attachments</strong>.</li></ol></div><p><strong>E. Migrate attachments using the Sage 300 Construction and Real Estate Server Data Migration Tool.</strong></p><ul><li><strong>IMPORTANT:</strong> If you use Sage Paperless Construction (SPS) or Timberscan, <strong>do not</strong> migrate the attachments, as doing so will break the connectivity with these programs. They have their own approved methods for migration.</li></ul><ol><li>Browse to the ..\\Timberline Office\\Shared folder and run the <strong>Sage.STO.ServerDataMigrator.exe</strong> program, if not already open from the previous section(s).</li><li>Select the Company(ies) that you want to migrate by checking the box in the Select column.</li><li>Select <strong>Migrate attachments</strong>.</li><li>Select <strong>Yes</strong> to continue.</li></ol><p style=\"margin-left: 40px;\" data-mce-style=\"margin-left: 40px;\"><strong>Note: </strong>You may receive warning \"Could not access SM database. Error migrating attachments from old server.\" Refer to DocLink: [[Error: \"Could not access SM database. Error migrating attachments from old server\"|224924550062226]] for solution.</p><p style=\"margin-left: 40px;\" data-mce-style=\"margin-left: 40px;\"><strong>Note:</strong> This process may take a long time and does not have a progress bar. Please allow time for it to complete. If the process is ended for any reason it can be run again, but will start again from the beginning.</p><p style=\"margin-left: 40px;\" data-mce-style=\"margin-left: 40px;\"><strong>Note:</strong> There will be a path for each folder that contains attachments. You may be able to select several listings as it may only be the first part that will need to be updated. See the chart below for example. All could be selected if only the Server is changing. If Electrical Sample is being moved to the Data folder, it would have to be updated separately.</p><p style=\"margin-left: 40px;\" data-mce-style=\"margin-left: 40px;\"><strong>Note:</strong> Sage Paperless Construction has a method to update and recreate the attachment sync links that is preformed as part of it's migration or as a process in Sage Paperless Construction if it has remained on it's server and just needs to be updated for the new location for Sage300CRE. See the linked article below.</p><ol start=\"5\"><li>In the <strong>Server Data Migration - Attachment Paths</strong> window select the old path to update by checking the box in the <strong>Select</strong> column. Then click on <strong>Change</strong> or <strong>Find and replace</strong> to update the path for these attachments.</li><li>Select <strong>Migrate attachments</strong> to complete the update.</li><li>Review the <strong>ServerDataMigrationLog</strong> to confirm a successful move.</li><li>Select <strong>Close</strong> when done.</li></ol><p><strong>Note:</strong> When you migrate Accounting and Management Products to a new location, you move the Sage 300 Construction and Real Estate application and data folders. You need the Sage 300 Construction and Real Estate Accounting and Management Products downloaded installation files for the version you are currently using because you also install components, such as the Pervasive or Actian database engine, in the new location.</p><p><strong>Post Migration Tasks:</strong></p><p><strong>Note:</strong> It is extremely important to perform these steps in order and be sure to update file locations on <strong>all</strong> company data folders. Please follow the steps even if it's a test migration.<br></p><ol><li>Once all migration tasks are complete, consider turning off old server or disabling all shares related to Sage 300 CRE such at the Timberline Office share. This will eliminate the possibility of having data updated on the old server because a file location is missed.</li><li>If you have migrated to a new server, you must uninstall the workstations and reinstall to point the workstations to the new server.</li><li><span style=\"color: #800000;\" data-mce-style=\"color: #800000;\"><strong>Open each company folder and check File locations: (navigation to this differs on versions) </strong></span><ol><li><span style=\"color: #800000;\" data-mce-style=\"color: #800000;\"><strong>File &gt; Company Settings &gt; File Locations </strong></span></li><li><span style=\"color: #800000;\" data-mce-style=\"color: #800000;\"><strong>Check each of the resources listed and update paths by UNC PATH if they exist. </strong></span><ul><li><span style=\"color: #800000;\" data-mce-style=\"color: #800000;\"><strong>It is especially important to update paths for any data files listed</strong></span></li><li><span style=\"color: #800000;\" data-mce-style=\"color: #800000;\"><strong>If there are mapped drives associated in this screen, please change to UNC Path. This will help prevent Ransomware from elevating it's permissions through mapped drives. Windows and Antivirus security may not allow mapped drives to bring this type of data across the network this way, regardless if you want to continue to use mapped drives. For more information on this, please speak with your IT regarding Windows Permissions and Ransomware.</strong></span></li></ul></li></ol></li><li>If you upgraded to a new version during the migration, be sure all updates have been applied and then upgrade your data files<ol><li>Log into TS Main on the Server as an administrator (or Desktop in versions 16.1 then in 17.1 there is no TSMain but still use desktop)</li><li>Select <strong>Tools</strong>, then <strong>Upgrade Files</strong></li><li>Choose whether to upgrade just the current data folder or all data folders listed in the Open Company list<ul><li>You can upgrade the main data folder first and then choose to upgrade all data folders later. The upgrade will skip any files that have already been upgraded.</li><li>You will be prompted for a file name for the upgrade log. Make a note of where the log is being saved and review it for errors later.</li><li>The upgrade is complete when the status in Background Tasks says \"Completed Normally\"</li></ul></li></ol></li><li>Upgrade the workstations by running the client installer from the workstation. See [[How do I install the Sage 300 Construction and Real Estate accounting client or workstation?|223924150028468]] below for more information.</li></ol></div><p><br><div class=\"col-xs-12 col-sm-7\">\n<h4>Need more help?</h4>\n<p style=\"margin-bottom: 24px;\"><a id=\"limitless-url\" class=\"btn btn-primary\" style=\"color: white; background-color: black; border: black; border-radius: 24px; margin-top: 8px; width: 40%;\" rel=\"noopener\" href=\"https://www.sage300construction.com/chat\" target=\"_blank\">Chat now</a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div><br><br><br>"
    },
    {
      "name": "Steps to duplicate",
      "content": ""
    },
    {
      "name": "Related Solutions",
      "content": "<p>[[What do I need to modify in Sage Paperless Construction if we migrate our accounting data to a different server?|220924260102832]]<br style=\"font-size: 14.6667px; letter-spacing: 0.2px;\" data-mce-style=\"font-size: 14.6667px; letter-spacing: 0.2px;\">[[How do I use the Pervasive Software Monitor Utility (PMU/PSMU) to unlock a file on a server that uses a Windows operating system?|222924350018202]]<br style=\"font-size: 14.6667px; letter-spacing: 0.2px;\" data-mce-style=\"font-size: 14.6667px; letter-spacing: 0.2px;\">[[MyAssistant Server Migration Instructions|222924550020259]]<br style=\"font-size: 14.6667px; letter-spacing: 0.2px;\" data-mce-style=\"font-size: 14.6667px; letter-spacing: 0.2px;\">[[How do I move/migrate Estimating to a new server and which files do I copy? (Pervasive)|222924750023263]]<br style=\"font-size: 14.6667px; letter-spacing: 0.2px;\" data-mce-style=\"font-size: 14.6667px; letter-spacing: 0.2px;\">[[How do I install the Sage 300 Construction and Real Estate accounting client on a workstation or Citrix/terminal server?|223924150028468]]<br style=\"font-size: 14.6667px; letter-spacing: 0.2px;\" data-mce-style=\"font-size: 14.6667px; letter-spacing: 0.2px;\">[[﻿Missing uses / licenses / modules 17.1.5 (and later)|225924450086855]]<br style=\"font-size: 14.6667px; letter-spacing: 0.2px;\" data-mce-style=\"font-size: 14.6667px; letter-spacing: 0.2px;\"></p>"
    }
  ],
  "id": "222924350018234",
  "language": "English",
  "lastModifiedDate": 1689362510000,
  "minorModifiedDate": 1707652177000,
  "keywords": "migrate raexternalrequest",
  "question": null,
  "renewDate": 1847145600000,
  "solutionBoost": 1.0,
  "status": "Published",
  "type": "Template Solution",
  "taxonomy": [
    "Category//Installation//Download"
  ],
  "templateName": "1 - Support Article",
  "title": "How to use the Migration Tool for Sage 300 Construction and Real Estate",
  "translations": [],
  "viewCount": 8795,
  "solvedCount": 304,
  "unsolvedCount": 1,
  "summary": "How do I use the Sage 300 Construction and Real Estate Server Migration Tool to move my program and data to a new server?",
  "revisionID": null,
  "templateSolutionID": "PRE2156630"
}