{
  "author": "sageadmin",
  "approver": "april.dahl@sage.com",
  "attributeSetName": null,
  "attributes": [],
  "categoryCode": "custom",
  "collections": [
    "custom_au_en_threehundredcre",
    "custom_ca_threehundred_construction",
    "custom_us_threehundred_construction"
  ],
  "createDate": 1683150186000,
  "diagnosticResponses": [],
  "fields": [
    {
      "name": "Description",
      "content": "<p>The Log Viewer (QL Master file, master.qlm) is log of activity in the software, such as user logins and logouts, the start and end of applications and tasks, error messages, some record setup information, Audit Setup Activity changes, and other information.</p>"
    },
    {
      "name": "Cause",
      "content": "<div style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\" data-mce-style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\"><p><br></p><p><br></p></div>"
    },
    {
      "name": "Resolution",
      "content": "<p><strong>IMPORTANT: </strong>To slow the growth of the file, it is recommended to turn off (unmark) logging for the <strong>Security</strong> log type in the Log Settings. This will stop the recording of the log in/out entries. Log Settings can be accessed one of two ways:</p> <ul> <li>Sage Desktop, <strong>Common Tasks</strong>, <strong>Log Viewer</strong>, then click <strong>Settings </strong>from the toolbar</li> <li>Sage Desktop, <strong>Options</strong>, <strong>Security Administration</strong>, <strong>Log Settings</strong></li> </ul> <p>&nbsp;</p> <p><strong>Option 1: Use the Archive feature within the Log Viewer window:</strong></p> <p><strong>Note:</strong></p> <ul> <li>When the <strong>Archive</strong> task is used the following information is displayed:</li> </ul> <p style=\"padding-left: 40px;\"><strong>[NOTE: Only 10,000 records at a time can be archived]:</strong></p> <ul> <li><span lang=\"EN\">Before archiving the Log Viewer, note that the current Log Viewer includes up-to-date logs. To archive specific dates, click <strong>Display</strong> at the top of the Log Viewer and choose <strong>Custom</strong> to set the date range. You may use <strong>Filters</strong> to limit the log entries by type.</span></li> <li><span lang=\"EN\">Archiving saves all details of your log data in an XML file. You select where to save the archive file and what to name it. You can access the XML file at any time for reference.</span></li> <li>Log Viewer data in the current view will be archived. Ensure that the Log Viewer filter and search parameters you have selected contain the data you want to archive.</li> <li>A log archive file (.xml) can contain a maximum of 10,000 records. Multiple log archive files are generated if more than 10,000 records are archived.</li> <li>A number (starting with \"1\") is appended to the file name of each additional log file.</li> </ul> <ol> <li>Have all users exit all Sage 300 Construction and Real Estate applications.</li> <li>Make a backup of the <strong>Global</strong> folder located under<strong> C:\\ProgramData\\Sage\\Timberline Office\\9.5\\Accounting\\Global</strong> on the server or<strong> \\\\[serversname]\\Timberline Office\\9.5\\Accounting\\Global</strong>.</li> <li>Launch the <strong>Log Viewer</strong>: <ul> <li>Versions 15.1 and earlier, from the Sage Desktop <strong>Tasks</strong> menu, select <strong>Sage 300 Construction and Real Estate</strong>, <strong>Common Tasks</strong>, <strong>Tools</strong>, <strong>Log Viewer</strong>.</li> <li>Versions 16.1 and newer, from the Sage Desktop <strong>Applications</strong> menu, select <strong>Common Tasks</strong>, <strong>Tools</strong>, <strong>Log Viewer</strong>.</li> </ul> </li> <li>If you don’t need to archive all of the log entries, change the <strong>Display date</strong> and <strong>Filter</strong>. The Log Viewer will archive currently displayed entries.</li> <li>Click <strong>Archive</strong>. <ul> <li>If you want to archive and delete the log entries from the Log Viewer, choose <strong>Archive and Delete</strong></li> <li>If you want to archive the log but keep the entries in the Log Viewer, choose <strong>Archive</strong></li> </ul> </li> <li><strong>Save</strong> the archive file to your chosen destination.</li> <li>If you chose <strong>Archive and Delete</strong>, compact the File:<br>To access<strong> File Doctor</strong>: <ol> <li>From the Sage Desktop Applications menu, select <strong>Common Tasks</strong>, <strong>Tools</strong>, <strong>File Doctor</strong>. <ul> <li><strong>Note:</strong> For versions 15.1 and older, from the Sage Desktop Tasks menu, select <strong>Sage 300 Construction and Real Estate</strong>, <strong>Common Tasks</strong>, <strong>Tools</strong>, <strong>File Doctor</strong><span style=\"display: none;\"> </span></li> </ul> </li> <li>Select the <strong>Compact Good Files</strong> check box.</li> <li>Select <strong>QL Master file</strong>.</li> <li>Click <strong>Start</strong>.</li> <li>When prompted, select a location and file name for the File Doctor report.</li> </ol> </li> </ol> <p><strong>Option 2: Move the master.qlm to an Archive folder using File Tools:</strong></p> <p>If your Log Viewer is too large to use the Archive feature, you can move the entire Log Viewer file (QLM files) to an Archive folder.</p> <p>If the size of the master_qlm folder in the Global\\PVData folder is more than 2GB, you will need to use Option 3 as the file is too large for File Tools.</p> <p><strong>IMPORTANT:</strong> Do not leave renamed QLM files in the Global folder. Move the files to an archive folder. Leaving renamed files behind in the Global folder can cause issues with ODBC, SQL Replicator, and third-party software.</p> <ol> <li>Have all users exit all Sage 300 Construction and Real Estate applications. Close any interfacing third party software and/or stop those services. It may retain a lock on the QLM file.</li> <li>To access <strong>File Tools</strong>: <ol> <li>From the Sage Desktop <strong>Applications</strong> menu, select <strong>Common Tasks</strong>, <strong>Tools</strong>, <strong>File Tools</strong>. <ul> <li>For versions 15.1 and older, from the Sage Desktop <strong>Tasks</strong> menu, select <strong>Sage 300 Construction and Real Estate</strong>, <strong>Common Tasks</strong>, <strong>Tools</strong>, <strong>File Tools</strong>.</li> </ul> </li> </ol> </li> <li>Click <strong>Move</strong> and <strong>Next</strong>.</li> <li>Click <strong>Add Files</strong>.</li> <li><strong>Browse</strong> to the <strong>Global</strong> folder on the server <strong>\\\\[serversname]\\Timberline Office\\9.5\\Accounting\\Global</strong>.</li> <li>Select the <strong>master.qlm</strong> file and click <strong>Open</strong>.</li> <li>In the <strong>Destination</strong> field, click the <strong>Browse</strong> button. Select or create a folder to store your archived log viewer (QLM) files, such as <strong>\\\\[serversname]\\Timberline Office\\9.5\\Accounting\\Archived Log Viewer files</strong>.</li> <li>Click <strong>Next</strong>.</li> <li>Verify that the <strong>Validation</strong> shows all green lights, then click <strong>Next</strong>.</li> <li>At <strong>Verify Files</strong>, click <strong>Next</strong>.</li> <li>At <strong>Execution Summary</strong>, click <strong>Next</strong>.</li> <li>Once the operation shows completed, click <strong>Finish</strong>.</li> <li>Sage will create a new QLM file when first opened by any user.</li> </ol> <p><strong>Option 3: If File Tools (Option 2) does not work or the file is too large, manually move the file:</strong></p> <p>If File Tools shows the master.qlm file is in use, File Tools may be locking it. If you receive a CP5 error, the file is too large to move with File Tools. You must move the file using File Explorer.</p> <p><strong>WARNING: You may want contact Sage 300 CRE Support or your Sage Consultant for help with the following steps:</strong></p> <ol> <li>Browse to the <strong>Accounting</strong> folder on the server (default location is C:\\ProgramData\\Sage\\Timberline Office\\9.5\\Accounting\\).</li> <li>Create an <strong>Archive Log Viewer</strong> folder. Inside the Archive Log Viewer folder create a <strong>PVData</strong> folder.</li> <li>Open the <strong>Global</strong> folder (default location is C:\\ProgramData\\Sage\\Timberline Office\\9.5\\Accounting\\Global).</li> <li>Move the <strong>master.qlm</strong> file from the root of Global folder into the Archive Log Viewer folder.</li> <li>Move the <strong>master_qlm</strong> folder from Global\\PVData into the Archive Log Viewer\\PVData folder. <ul> <li>Note: For large QLM files there will be files with a number appended to the name (e.g., QLM^1, QLM^2) inside the master_qlm. These extended files should move with the files in the master_qlm into the Archive Log Viewer\\PVData folder.</li> </ul> </li> <li>Sage will create a new QLM file when re-opened by any user.</li> </ol> <p><br><br><div class=\"col-xs-12 col-sm-7\">\n<h4>Need more help?</h4>\n<p style=\"margin-bottom: 24px;\"><a id=\"limitless-url\" class=\"btn btn-primary\" style=\"color: white; background-color: black; border: black; border-radius: 24px; margin-top: 8px; width: 40%;\" rel=\"noopener\" href=\"https://www.sage300construction.com/chat\" target=\"_blank\">Chat now</a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div><br><br><br></p>"
    },
    {
      "name": "Steps to duplicate",
      "content": ""
    },
    {
      "name": "Related Solutions",
      "content": "<p>[[Issues caused by a large Log Viewer file (QLM)|220924160100808]]<br style=\"font-size: 14.6667px; letter-spacing: 0.2px;\" data-mce-style=\"font-size: 14.6667px; letter-spacing: 0.2px;\">[[How do I use File Tools to back up data files?|222924150017256]]<br style=\"font-size: 14.6667px; letter-spacing: 0.2px;\" data-mce-style=\"font-size: 14.6667px; letter-spacing: 0.2px;\">[[How do I control what gets logged in the log viewer?|225924450087577]]<br style=\"font-size: 14.6667px; letter-spacing: 0.2px;\" data-mce-style=\"font-size: 14.6667px; letter-spacing: 0.2px;\">[[﻿Log In/Out entries from interfacing software are filling the Sage Log Viewer|225924650095344]]</p>"
    }
  ],
  "id": "222924450019543",
  "language": "English",
  "lastModifiedDate": 1716246291000,
  "minorModifiedDate": 1716246291000,
  "keywords": "master.qlm QLM Log",
  "question": null,
  "renewDate": 1873929600000,
  "solutionBoost": 1.0,
  "status": "Published",
  "type": "Template Solution",
  "taxonomy": [
    "Category//Transactions"
  ],
  "templateName": "1 - Support Article",
  "title": "How to archive the Log Viewer",
  "translations": [],
  "viewCount": 5601,
  "solvedCount": 119,
  "unsolvedCount": 1,
  "summary": "This document provides the steps to archive the Sage 300 CRE Log Viewer in versions 9.7 and above.",
  "revisionID": null,
  "templateSolutionID": "PRE2157142"
}