{
  "author": "sageadmin",
  "approver": "angie.gwalchmai@sage.com",
  "attributeSetName": null,
  "attributes": [],
  "categoryCode": "custom",
  "collections": [
    "custom_au_en_threehundredcre",
    "custom_ca_threehundred_construction",
    "custom_us_threehundred_construction"
  ],
  "createDate": 1683225167000,
  "diagnosticResponses": [],
  "fields": [
    {
      "name": "Description",
      "content": "<p>When printing Accounts Payable checks, it verifies the check number against Cash Management to confirm duplicate numbers aren't used in Sage 300 CRE.</p> <p>You can only reuse check numbers in Accounts Payable if the number isn't in the Cash Management Register and the check was voided.</p>"
    },
    {
      "name": "Cause",
      "content": "<div style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\" data-mce-style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\"><br></div><div style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\" data-mce-style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\"><br></div>"
    },
    {
      "name": "Resolution",
      "content": "<p><strong>Before you Begin</strong></p> <ul> <li>If you need to correct the check date, see [[How do I correct the check date or payment date of an Accounts Payable check or electronic payment?|222924150017031]]</li> <li>If the Checks are in the incorrect order, see [[How do I renumber or re-sequence Accounts Payable checks using Reprint Checks?|224924550063097]]</li> <li>If the check was recorded as a Manual check in Record Manual/Print Quick Check, Void the check and select the Delete Check option when prompted. See [[How do I void an Accounts Payable check or payment?|222924250017504]] for details.</li> <li>If the check number and amount was correct but the invoice distribution needs to be updated see [[What changes can I make to a fully paid invoice in Accounts Payable?|222924150017494]] for details on what changes can be made in Change invoice to correct a paid invoice.</li> </ul> <p><strong>Follow these steps to void and move an Accounts Payable check number to history to be able to reuse the check number:</strong></p> <p><strong>Note:</strong> Create a backup copy of your Sage 300 CRE company data. If you have not completed your bank set up (completed the \"go live\" process in CM Setup Assistant), refer [[How do I set up a new bank account in Cash Management?|222924250017697]] before using these steps. You can void checks when your bank account is not fully set up, but you cannot reconcile and move checks as instructed in steps 3, 4 and 5.</p> <p><strong>If the check is already voided, start at step 3.</strong></p> <ol> <li>Change the reconciled status of the check you want to void and reuse. You can only void checks with a reconciled status of Open. See [[How do I change the reconciliation status of a transaction in Cash Management?|222924750022176]] <ul> <li><strong>Note:</strong> Skip this step if the check was not previously reconciled or cleared in Cash Management.</li> </ul> </li> <li>Void the check in Accounts Payable. See [[How do I void an Accounts Payable check or payment?|222924250017504]] <ul> <li><strong>Note:</strong> If the check is a <strong>Manual</strong> check, select the option to <strong>Delete</strong> the check when you void it. You can delete manual checks and reuse the number. If you delete a manual check, you do not need to proceed with the rest of this solution. If you want to reuse the check number of a <strong>Machine</strong> printed check, or if you voided a manual check without deleting it, continue with the rest of this solution.</li> </ul> </li> <li>In Cash Management, manually reconcile the voided check in <strong>Edit Register</strong> by changing the status from <strong>O</strong> to <strong>R</strong>. See [[How do I change the reconciliation status of a transaction in Cash Management?|222924750022176]] <ul> <li><strong>Note:</strong> When you manually reconcile the voided check in Cash Management, leave the <strong>Cleared amount</strong> as zero and use a current period date for the <strong>Cleared date</strong> that does not correspond with a month end date or bank reconciliation statement date.</li> </ul> </li> <li>Move the voided check that you manually reconciled from the Cash Management <strong>Register.cmt</strong> file to the <strong>History.cmt</strong> file as follows: <ul> <li><strong>Note:</strong> Depending on the speed of your network, your computer, and the number of transactions you have in your bank account, the <strong>Move Checks</strong> process could take a substantial amount of time. <ol> <li>Make a backup of your data folder. See [[How do I use File Tools to back up data files?|222924150017256]]</li> <li>In Cash Management, from the <strong>Tools</strong> menu, select <strong>Move Entries</strong>, <strong>Register To History</strong>.</li> <li>Click <strong>OK</strong> if you receive the message \"The CM History Transaction file was not found. The file will be created.\"</li> <li>Place your cursor within the <strong>Beginning statement date</strong> box.</li> <li>Enter the <strong>Cleared date</strong> from step 3 in both the <strong>Beginning Statement date</strong> and<strong> Ending Statement date</strong> boxes.</li> <li>Click <strong>Conditions</strong>, select <strong>Bank Account</strong>, under <strong>Operator</strong> select <strong>Equal To</strong>, in the <strong>Value</strong> enter the applicable bank account ID, then click <strong>OK</strong>.</li> <li>Click <strong>Add</strong>, select <strong>Check</strong>, under <strong>Operator</strong> select <strong>Equal To</strong>, in the <strong>Value</strong> enter the check number of the voided check, then click <strong>OK</strong>.<br><strong>Note:</strong> To verify the correct transactions will be moved you can preview what transactions match the conditions, click <strong>Ranges</strong> and when prompted to apply conditions to ranges select <strong>Yes</strong>. The results will be the transactions that match your conditions. Verify that these are correct. If you want these selected, you will need to highlight and then click okay in the <strong>Ranges</strong> box.</li> <li>Click <strong>Printer Setup</strong>, select the <strong>Print to file</strong> check box, and then click <strong>OK</strong>. Do not clear the check box if it is already selected.</li> <li>Click <strong>Start</strong>, specify a file name for the <strong>Move Entries</strong> journal, and then click <strong>Save</strong> to begin the move checks process.<br><strong>Reminder:</strong> Depending on the speed of your network, your computer, and the number of transactions you have in your bank account, the <strong>Move Checks</strong> process could take a substantial amount of time.</li> <li>Review the <strong>Move Entries</strong> journal (<strong>File</strong>, <strong>Printouts</strong>) to verify that your check moved successfully.</li> </ol> </li> </ul> </li> <li>Move the voided check from the Cash Management <strong>History.cmt</strong> file to another <strong>History.cmt</strong> file as follows: <ul> <li><strong>Note:</strong> Depending on the speed of your network, your computer, and the number of transactions you have in your bank account, the <strong>Move Checks</strong> process could take a substantial amount of time. <ol> <li>In Cash Management, from the <strong>Tools</strong> menu, select <strong>Move Entries</strong>, <strong>History To History</strong>.</li> <li>In the <strong>Destination File Selection</strong> window, create a new folder inside your company data folder specifically to move these voided checks into. You may name this folder \"Junk\" or \"CM voided checks\" or any other name you choose that specifies the purpose of this folder. If you already have a folder designated for this purpose, select that folder.</li> <li>Click <strong>Open</strong>.</li> <li>Click <strong>Yes</strong> if you receive the message, \"File not found. Okay to create?\"</li> <li>Place your cursor within the <strong>Beginning statement date</strong> box.</li> <li>Click <strong>List</strong>, select the <strong>Cleared date</strong> from step 3 above when the voided check was reconciled, and then click <strong>OK</strong>.</li> <li>Verify that the <strong>Cleared date</strong> prefills in both the <strong>Beginning statement date</strong> box and the <strong>Ending statement date</strong> box.</li> <li>Click <strong>Printer Setup</strong>, select the <strong>Print to file</strong> check box, and then click <strong>OK</strong>. Do not clear the check box if it is already selected.</li> <li>Click <strong>Start</strong>, specify a file name for the <strong>Move Entries</strong> journal, and then click <strong>Save</strong> to begin the move checks process. <ul> <li><strong>Reminder:</strong> Depending on the speed of your network, your computer, and the number of transactions you have in your bank account, the <strong>Move Checks</strong> process could take a substantial amount of time.</li> </ul> </li> <li>Review the <strong>Move Entries</strong> journal (<strong>File</strong>, <strong>Printouts</strong>) to verify that your check moved successfully.</li> </ol> </li> </ul> </li> <li>Reuse the check number in Accounts Payable through the <strong>Record Manual/Print Quick Checks</strong> task<strong> </strong>or the <strong>Print Checks</strong> task as appropriate. <ul> <li><strong>Note:</strong> If you print checks using AvidXchange (formerly Piracle Create-A-Check) or PrintBoss and you have selected the <strong>Print using MICR encoding</strong> check box in Accounts Payable <strong>File</strong>, <strong>AP Settings</strong>, <strong>Payment Settings</strong>, you cannot specify a starting check number in the <strong>Print Checks</strong> task. In this case, see [[How do I change the starting check number for Accounts Payable or Payroll checks?|222924150017162]] to change the default starting check number in Accounts Payable.</li> </ul> </li> <li>If you need to re-reconcile the replacement check in <strong>Edit Register</strong>, see [[How do I change the reconciliation status of a transaction in Cash Management?|222924750022176]] <ul> <li><strong>Note:</strong> If you voided a check that was previously reconciled, Cash Management balances may not be correct unless you reissue and reconcile another check with the same accounting date, <strong>Cleared date</strong>, and amounts.</li> </ul> </li> </ol> <p>&nbsp;</p> <p>Currently, there are no settings to allow the reuse of voided checks. If you would like to see additional options, we would be happy to hear your feedback. We have created a form to contact our developers with recommendations see&nbsp;[[How do I submit enhancement requests for Sage 300 Construction and Real Estate?|223924650039299]]&nbsp;for information on submitting ideas and requests.</p> <p>&nbsp;</p> <div class=\"col-xs-12 col-sm-7\">\n<h4>Need more help?</h4>\n<p style=\"margin-bottom: 24px;\"><a id=\"limitless-url\" class=\"btn btn-primary\" style=\"color: white; background-color: black; border: black; border-radius: 24px; margin-top: 8px; width: 40%;\" rel=\"noopener\" href=\"https://www.sage300construction.com/chat\" target=\"_blank\">Chat now</a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div> <p><br><br><br></p>"
    },
    {
      "name": "Steps to duplicate",
      "content": ""
    },
    {
      "name": "Related Solutions",
      "content": ""
    }
  ],
  "id": "222924250017913",
  "language": "English",
  "lastModifiedDate": 1683225167000,
  "minorModifiedDate": 1738103130000,
  "keywords": "AP reuse-check void-check",
  "question": null,
  "renewDate": 1680566400000,
  "solutionBoost": 1.0,
  "status": "Published",
  "type": "Template Solution",
  "taxonomy": [
    "Category//Transactions//Corrections"
  ],
  "templateName": "1 - Support Article",
  "title": "How do I void and reuse an Accounts Payable check number for error correction?",
  "translations": [],
  "viewCount": 2295,
  "solvedCount": 125,
  "unsolvedCount": 2,
  "summary": "Void and reuse Accounts Payable check numbers in Sage 300 CRE.",
  "revisionID": null,
  "templateSolutionID": "PRE2156468"
}