{
  "author": "LegacyAuthorUS",
  "approver": "angie.gwalchmai@sage.com",
  "attributeSetName": null,
  "attributes": [],
  "categoryCode": "custom",
  "collections": [
    "custom_au_en_threehundredcre",
    "custom_ca_threehundred_construction",
    "custom_us_threehundred_construction"
  ],
  "createDate": 1683148523000,
  "diagnosticResponses": [],
  "fields": [
    {
      "name": "Description",
      "content": "<p>Procedure below applies if the balances on the Bank Reconciliation report appear incorrect. For example,</p> <ul> <li>Bank Statement Ending Balance</li> <li>Adjusted Bank Balance</li> <li>Register Balance as of Statement Date</li> <li>Register Balance Adjusted for Future Voids</li> </ul> <p>You can also follow this procedure if the cash account does not balance your financials.</p>"
    },
    {
      "name": "Cause",
      "content": ""
    },
    {
      "name": "Resolution",
      "content": "<span class=\"ra-content-caution\" style=\"color: #b94a48;\"><img src=\"https://internal-kb.sage.com/portal/app/images/content_caution.gif\" alt=\"\" /> <strong>CAUTION:</strong>&nbsp;</span><span style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><span style=\"color: #b94a48;\">Sage support can't assist with third-party products, hardware, report customizations, or state and federal tax questions. Refer to our </span>[[<span style=\"color: #0906fa;\">Scope of Support</span>|221924150011251]]<span style=\"color: #b94a48;\"> for more info. Contact your Sage business partner, network administrator, or accountant for assistance.</span></span> <p>&nbsp;</p> <h3>Prerequisites before printing the report</h3> <ol> <li>Confirm that there aren't any bank reconciliations in progress.</li> <li>Go to <strong>Cash Management</strong>, <strong>Setup</strong>, <strong>Bank Accounts</strong>, <strong>General</strong> tab. Confirm the <strong>Last reconciled date</strong>&nbsp;and the <strong>Last reconciled balance</strong> are correct. Verify the <strong>Last reconciled balance</strong> matches the ending balance on the bank statement.</li> <li>Outstanding or open items are correct and have a Reconciliation Status of O. Look for previously reconciled items changed to \"O\" for error correction but weren’t re-reconciled. Look for items that should be outstanding/open but aren’t. Their status may have changed to C or R. Correct items with a status of C to O or R before correcting balances. <ul> <li>You can use <strong>CM Inquiry</strong>, <strong>Bank Register</strong>&nbsp;to see outstanding/open items. Drill down from Bank Account to transactions, and add a condition for the <strong>Reconciliation Status equal to O</strong>. If you find items with an incorrect Reconciliation Status, [[change the status of the transaction in Cash Management.|222924750022176]]</li> </ul> </li> <li>Cleared but not reconciled items should have a <strong>Reconciliation Status</strong> of <strong>C</strong>. These items are marked cleared between bank statement reconciliations when using <strong>Import Cleared Checks</strong>. Look for previously reconciled items that have been changed for error correction that don't have the <strong>R</strong> status.</li> <li>Look for items that have a cleared status (<strong>C</strong>) but should be outstanding/open (<strong>O</strong>). <ul> <li>To see cleared (but not reconciled) items, go to <strong>CM Inquiry,</strong> <strong>Bank Register. </strong>Drill down to the bank account transactions and add a condition for the<strong> Reconciliation Status equal to</strong> <strong>C</strong>. If you find items with the wrong Reconciliation Status, [[correct the status of the transaction in Cash Management.|222924750022176]]</li> </ul> </li> </ol> <h3>Reconciling Cash Management</h3> <ol> <li>In Cash Management from the <strong>Reports</strong> menu, select <strong>Reconciliation</strong>, <strong>Bank Acct Bal Verification</strong>.</li> <li>Select the <strong>Register</strong> file and click <strong>OK</strong>.</li> <li>Click <strong>Print Preview</strong> or click <strong>Start</strong> to print the report.</li> <li>Review the report to verify your bank account balances are correct: <ol style=\"list-style-type: lower-alpha;\" type=\"square\"> <li>Verify the <strong>Derived Bank Balance</strong> equals the <strong>Bank Account Bank Balance</strong>.</li> <li>Verify the <strong>Derived Posted CM Balance</strong> equals the <strong>Posted (CM) Balance</strong>.</li> <li>Verify the <strong>Derived Register Balance</strong> equals the <strong>Register Balance</strong>.</li> <li>Verify the <strong>Open Derived</strong> amounts equal the <strong>Open from Bank Account</strong> amounts.</li> <li>Verify the <strong>Unreconciled Derived</strong> amounts equal the <strong>Unreconciled from Bank Account</strong> amounts.</li> </ol> </li> <li>If any totals don’t match, [[turn on <strong>Audit setup activity</strong>|222924150017021]] and correct the amounts the bank account. Use the derived balances from the <strong>Bank Account Balance Verification</strong> report as follows:&nbsp; <ol style=\"list-style-type: lower-alpha;\"> <li>In Cash Management, from the <strong>Setup</strong> menu, select <strong>Bank Account</strong>.</li> <li>If prompted, click <strong>Start</strong> to print the audit report.</li> <li>In the <strong>Bank account</strong> list, select your bank account.</li> <li>On the <strong>General</strong> tab, replace the <strong>Register balance</strong> with the <strong>Derived Register Balance</strong>.</li> <li>On the <strong>General</strong> tab, replace the <strong>Bank balance</strong> with the <strong>Derived Bank Balance</strong>.</li> <li>On the <strong>Totals by GL Cash Acct</strong> tab, replace the <strong>Posted (CM) Balance</strong> and <strong>Amount</strong> with the <strong>Derived Posted CM Balance</strong>.</li> <li>On the <strong>Totals by GL Cash Acct</strong> tab, determine the correct amount for each cash account and adjust the amounts accordingly. If you use multiple cash accounts with your bank account, verify and/or correct all your cash accounts. Delete any lines with blank cash accounts. When you finish, the amounts for each cash account should sum to the <strong>Posted (CM) Balance</strong>. In a one-to-one relationship, the amounts should be equal.</li> <li>On the <strong>Totals</strong> tab, replace the various open amounts with the appropriate <strong>Open Derived</strong> amounts.</li> <li>On the <strong>Totals</strong> tab, replace each of the various unreconciled amounts with the appropriate <strong>Unreconciled Derived</strong> amounts.</li> <li>Press ENTER to update the <strong>Open total</strong> and <strong>Unreconciled total</strong> after you correct the appropriate open and unreconciled amounts.</li> <li>Click <strong>Close</strong> and then turn off <strong>Audit setup activity</strong>.</li> </ol> </li> </ol> <p>&nbsp;</p> <p>&nbsp;</p> <div class=\"col-xs-12 col-sm-7\"> <h4>Need more help?</h4> <p style=\"margin-bottom: 8px;\"><a id=\"limitless-url\" class=\"btn btn-primary\" style=\"color: white; background-color: black; border: black; border-radius: 24px; margin-top: 8px; width: 40%;\" rel=\"noopener\" href=\"https://www.sage300construction.com/chat\" target=\"_blank\">Chat now</a></p> </div> <p><br><br></p>"
    },
    {
      "name": "Steps to duplicate",
      "content": ""
    },
    {
      "name": "Related Solutions",
      "content": "<p>[[Can the CM Bank Account Balance Verification report be ran for one bank instead of all of them?|220924460106085]]</p> <p>[[The Cash Management Bank Account Balance Verification report has variances|222924850025292]]</p> <p>[[Register Balance as of Statement Date does not match Adjusted Bank Balance on my Bank Reconciliation report (item's Cleared date is before the Reference date)|222924850025387]]</p> <p>[[Register Balance as of Statement Date or Adjusted Bank Balance totals are incorrect on the Bank Reconciliation report (reconciled transaction has future date)|223924250030443]]</p> <p>[[The Adjusted Bank Balance is incorrect on the Cash Management Bank Reconciliation report (items are Cleared instead of Reconciled)|223924450036153]]</p> <p>[[The Bank Statement Ending Balance on my Bank Reconciliation report is incorrect in Cash Management (item was reconciled that did not clear the bank)|224924250053413]]</p> <p>[[The Bank Statement Ending Balance on my Bank Reconciliation report is incorrect in Cash Management (item that cleared the bank is open)|224924350057297]]</p>"
    }
  ],
  "id": "222924650022089",
  "language": "English",
  "lastModifiedDate": 1726534245000,
  "minorModifiedDate": 1736543002000,
  "keywords": "Reconciliation out-of-balance bank-statement CM",
  "question": null,
  "renewDate": 1884297600000,
  "solutionBoost": 1.0,
  "status": "Published",
  "type": "Template Solution",
  "taxonomy": [
    "Category//Transactions//Bank//Reconciliation"
  ],
  "templateName": "1 - Support Article",
  "title": "How do I verify if my Cash Management balances are correct?",
  "translations": [],
  "viewCount": 1659,
  "solvedCount": 110,
  "unsolvedCount": 0,
  "summary": "I want to reconcile Cash Management transactions to CM totals. How do I verify that cash management balances are correct in Sage 300 CRE?",
  "revisionID": null,
  "templateSolutionID": "PRE2158089"
}