{
  "author": "sageadmin",
  "approver": "angie.gwalchmai@sage.com",
  "attributeSetName": null,
  "attributes": [],
  "categoryCode": "custom",
  "collections": [
    "custom_au_en_threehundredcre",
    "custom_ca_threehundred_construction",
    "custom_us_threehundred_construction"
  ],
  "createDate": 1683137767000,
  "diagnosticResponses": [],
  "fields": [
    {
      "name": "Description",
      "content": "<div style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\" data-mce-style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\"><br></div>"
    },
    {
      "name": "Cause",
      "content": "<div style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\" data-mce-style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\"><br></div>"
    },
    {
      "name": "Resolution",
      "content": "<p><span class=\"ra-content-caution-1 mceNonEditable\" style=\"color: #b94a48;\"><span><img class=\"ra-att-img\" src=\"https://internal-kb.sage.com/portal/app/images/content_caution.gif\" alt=\"\" width=\"18px\" height=\"17px\" />&nbsp;<strong class=\"ra-att-title\">CAUTION:</strong> This solution requires advanced knowledge of Windows security and network settings. Sage isn't responsible for any issues that arise from changes to these settings. Ensure you back up all system and application databases necessary for a complete restoration. It's advisable to contact a certified consultant or your system administrator for assistance.</span></span></p> <p>&nbsp;</p> <p>How to perform a manual migration of Sage 300 Construction and Real Estate version 9.5 and later to the following operating systems:</p> <ul> <li>Windows Vista,&nbsp;Windows 7 and later</li> <li>Windows Server 2008 and later</li> </ul> <p>&nbsp;</p> <p>Supported operating systems vary by version. See <a href=\"https://cdn.na.sage.com/docs/en/customer/300cre/Documentation.htm\">300 CRE Product Documentation</a> for System Requirements for each version.</p> <p>&nbsp;</p> <h3>Using the Migration Tool</h3> <p>The Migration Tool is the preferred method to migrate Sage 300 CRE to a new server.</p> <p>Some benefits of using the Migration Tool are:</p> <ul> <li>It provides an easy-to-use interface, and simplifies the migration process</li> <li>You can&nbsp;upgrade to the next version in the upgrade path</li> <li>Macros migrate to the new server if they're in the company folder, so you don't need to recreate them</li> <li>Automatically updates some custom report paths - it updates UNC paths but not mapped drives</li> <li>Migrate attachments to the new server and remap their file paths automatically (no need to manually update file paths)</li> </ul> <p>The original server must be functioning and available on the network to use the Migration Tool. If a hardware failure happened or the original server is offline, perform a manual migration instead of using the Migration Tool.</p> <p>For complete instructions on how to use the Migration Tool refer to the Installation Guide or User's Guide. You can also see these [[steps to use the Migration Tool|222924350018234]].</p> <p>When moving data to a new server, don't copy the data folders to non-UAC compliant locations such as <strong>C:\\Program Files\\</strong>&nbsp;or&nbsp;<strong>C:\\Program Files (x86)\\</strong>. See the User's Guide (12.1 and later) for more information on UAC-compliant locations. The default location for data is <strong>\\\\ServerName\\Timberline Office\\Data</strong>.</p> <p>&nbsp;</p> <h3>Manual Migration</h3> <h4>Overview of Process</h4> <ol> <li>Copy Company data folders from the original server to the new server.</li> <li>Copy the&nbsp;<strong>9.5</strong>&nbsp;folder from the original server to&nbsp;<strong>C:\\ProgramData\\Sage\\Timberline Office\\9.5&nbsp;</strong>on the new server.</li> <li>Install the same version of Sage 300 CRE to the new server.</li> </ol> <p>&nbsp;</p> <h4>Important Considerations</h4> <ul> <li>This process is complex. Read this entire article before attempting to move your Sage 300 CRE Accounting files to a new server. If any step is unclear, contact your business partner or Customer Support for assistance before the process begins.</li> <li>On the new server, reinstall the same version of Sage 300 CRE. Be sure to apply any patches or software updates on the new server that you applied on the original server.</li> <li>After migrating your current version of Sage 300 CRE to the new server, test the applications in the new location.&nbsp;Install the newer version after confirming successful tests.</li> <li>If the drive mapping to Sage 300 CRE on the server changes at the workstation, then the link to any custom reports will longer work. To resolve the issue, update the path specified for your custom reports in Reports Manager from the Reports menu of the appropriate applications.</li> <li>If you have Estimating Products on the destination machine, remove them before beginning to install Accounting products. Reinstall Estimating products after you install Accounting products.</li> <li>Validate that you have enough drive space on the new server to install. Sage 300 CRE installs various files to the same drive location as the ProgramData folder, typically the C: drive. You must have at least 4 GB of space available on this drive to install Sage 300 CRE. Drive space requirements vary by version. Refer to the product documentation for more information.</li> <li>These instructions have changed. In previous versions of these instructions, there was a requirement to set up a registry key and to have your activation codes prefill. We've removed those requirements.</li> </ul> <p>&nbsp;</p> <h4>On the old server</h4> <ol> <li>Have all operators exit all Sage 300 CRE applications.</li> <li>Check File Locations (if any) for each company data folder: <strong>File, Company Settings, File Locations</strong>. <ul> <li>File Locations are company specific so you need to log into each company to check the file locations</li> <li>If data is in file locations different than your main company data, confirm you copy the data&nbsp;to the new server</li> <li>Make note of file locations as you'll need to re-point these locations on the new server. UNC paths are recommended</li> </ul> </li> <li>If you have PJ Correspondence log attachments, note their location and copy them to the new server. <ul> <li>Note: After migration is complete and you've moved the attachments, remove them from existing log entries in PJ and reattach them from the new location. Or refer to [[How do I correct my Project Management correspondence log attachments after migrating my data to another server or location?|222924450019051]] to correct the path to the attachments.</li> </ul> </li> <li>Back up the Sage 300 CRE data. Confirm that the backup is successful before continuing. <ul> <li>Back up all company data.</li> <li>Back up the <strong>\\Sage\\Timberline Office\\9.5</strong> folder located under: <ul> <li>Windows Vista, Windows 7 and later: <strong>C:\\ProgramData\\Sage\\Timberline Office\\9.5</strong></li> <li>XP and Server 2003: <strong>C:\\Documents and Settings\\All Users\\Application Data\\Sage\\Timberline Office\\9.5</strong></li> </ul> </li> </ul> </li> <li>If your new server will have the same server name, path names, and share names, proceed to step 7.</li> <li>IF STEP 5 DOES NOT APPLY COMPLETE THE FOLLOWING BEFORE MOVING ON TO STEP 7. <ul> <li>If your new server will have a different server name, path names, or share names, remove all companies from the <strong>Open Company</strong> window. Complete this on the original server before&nbsp;to migrating.<br>This will ensure that the <strong>Security Administration</strong> contains no <strong>Company Folder path</strong> information with references to the original server.<br><strong>Note:</strong> If you have multiple companies and multiple users, download and run the <a rel=\"noopener\" href=\"http://nasapprwdin1.gs.adinternal.com:8102/irj/go/km/docs/sageKM/Sage%20Timberline/Assets/securityreports.zip\" target=\"_blank\"><span style=\"color: #008469; font-size: 10pt;\"><span style=\"color: #008469;\">Security Reports</span></span></a> to generate a list of users by company before removing companies. Refer to [[How do I save, add, and print a report design?|222924350018607]] for more information.</li> </ul> </li> <li>Copy the 9.5 folder from the original server to <strong>C<em>:\\</em>ProgramData\\Sage\\Timberline Office\\9.5</strong> on the new server. Check the following locations for the 9.5 folder: <ul> <li>Windows 2003/XP: <strong>C<em>:\\</em>Documents and Settings\\All Users\\Application Data\\Sage\\Timberline Office\\9.5</strong><strong> </strong></li> <li>Server 2008/Vista/Windows 7: <strong>C<em>:\\</em>ProgramData\\Sage\\Timberline Office\\9.5</strong> <ul> <li>The <strong>C:\\ProgramData</strong> folder defaults to hidden. Show hidden files and folders in folder options to see <strong>C:\\ProgramData</strong>. Also, it's correct that there's no space in <strong>C:\\ProgramData</strong></li> <li>The <strong>Timberline Office\\9.5</strong> folder will remain <strong>9.5</strong> even if you've upgraded to 9.6 or later. Don't change the name of this folder</li> </ul> </li> </ul> </li> <li>Copy all Sage 300 CRE company data to the new server: <ul> <li>The default location for data is <strong><em>C:\\</em>ProgramData\\Sage\\Timberline Office\\Data</strong></li> <li>Place the data in a location that is shared and available to all Sage 300 CRE Users</li> </ul> </li> <li>If you have <strong>Version 17.1.5 or higher </strong>installed on this server, then you will need to Deauthorize the old server via License Administration. If you are on <strong>17.1.4 or lower, skip down to Section B.</strong> <ol> <li>Open License Administration (Start menu, Sage Administration, License Administration).</li> <li>Click the \"Deauthorize Server\" button on the right in License Administration.</li> <li>Close License Administration.</li> <li>If you can't open License Administration<strong> </strong>on the old server, then call into Sage 300 CRE support (800-551-8307) to have your old server deauthorized.</li> </ol> </li> </ol> <h4>Install the same version of Sage 300 CRE on the new server</h4> <ol> <li>Install the same version of Sage 300 CRE on the new server.</li> <li>Verify that the installation automatically enters your registration name, client number, and software country. The activation codes won't prefill. <ul> <li><strong>WARNING:</strong> If the installation doesn't prefill your registration name, client number, and software country, contact Customer Support for assistance. If you proceed with the installation, you may lose your customization.</li> </ul> </li> <li>If installing&nbsp;<strong style=\"font-size: 14.6667px; letter-spacing: 0.2px;\">Version 17.1.5 or higher</strong><span style=\"font-size: 14.6667px; letter-spacing: 0.2px;\">, skip to step 4 below. </span>If installing<strong> Version 17.1.4 or lower</strong>, when prompted to enter the number of uses and activation codes: <ol> <li>Manually enter the number of uses and activation codes.</li> <li>You can use the AccActivation.xml file in the Wininst folder of the old Server to prefill the number of uses, and activation codes. <ul> <li>Copy the AccActivation.xml file from the old server's Wininst folder to the desktop of the new server. The file is located in one of these locations: <ul> <li>C:\\ Documents and Settings\\All Users\\Application Data\\Sage\\Timberline Office\\9.5\\Accounting\\Wininst</li> <li>C:\\ProgramData\\Sage\\Timberline Office\\9.5\\Accounting\\Wininst) to the desktop of the new server</li> </ul> </li> <li>When you reach the activation grid during the new server install, drag the AccActivation.xml file into the activation grid. When your mouse pointer turns to a + sign, drop it and your activation codes prefill. Drag it again if it doesn't work the first time. Otherwise, click inside one of the <strong>Uses</strong> cells and press <strong>ctrl+shift+F10</strong> to allow you to browse for the AccActivation.xml file.</li> </ul> </li> </ol> </li> <li>Complete the installation of Sage 300 CRE. For complete instructions, see the User Guide in <a rel=\"noopener\" href=\"https://cdn.na.sage.com/docs/en/customer/300cre/Documentation.htm\" target=\"_blank\">Product Documents</a>. <ul> <li>Verify share and permission setup on the <strong>Timberline Office</strong> folder at <strong>C:\\ProgramData\\Sage</strong> location on the new server. Creating a share higher or lower than this folder may cause unexpected errors to occur.</li> <li>When you add your data to the Company List, you must use the UNC paths. For example \\<strong>\\ServerName\\Timberline Office\\Data\\Company</strong>. For more information, refer to the product documentation.</li> </ul> </li> <li>If on <strong>Version 17.1.5 or higher</strong>, open License Administration (Start menu, Sage Administration, License Administration). Enter your Sage Client ID and Registration Name to activate the new server.</li> </ol> <h4>Post Migration Steps</h4> <ol> <li>Once all migration tasks are complete, consider turning off the old server or disabling all shares related to Sage 300 CRE. This eliminates the possibility of having data updated on the old server because a file location is missed.</li> <li>Open each company folder and check File Locations. <ol> <li><strong>File</strong>, <strong>Company Settings</strong>, <strong>File Locations</strong>.</li> <li>Check each of the resources listed and update paths if they exist. <ul> <li>If your tax.prx file is located outside of the files you moved from the old server, you may need to copy that file to the new server and make certain that the file location for that file is pointed to the new location on the new server.</li> <li>It's especially important to update paths for any data files listed.</li> </ul> </li> </ol> </li> <li>If you have any custom reports, the file paths may need to be updated. Refer to [[How do I edit a report location?|223924950047596]]</li> <li>If you set up macros, you may need to set up those macros again.</li> <li>The application administrator must re-select companies in the <strong>Select Company</strong> window. Do this by opening <strong>TS-Main</strong> or Sage <strong>Desktop</strong> and choosing the specify button in the <strong>Select Company</strong> window to browse to the location of the company folders.</li> <li>Once you add the company folders to the <strong>Select Company</strong> window, the application administrator must open Security Administration and add users to those companies. Refer to [[No company folders visible after migration for non-admin users|222924850024889]]</li> <li>Uninstall Sage 300 CRE on your workstations and reinstall from the new server location. <ul> <li>Apply any patches or updates that you applied on the server</li> <li>Find the workstation installation at <strong>\\\\ServerName\\Timberline Office\\9.5\\Accounting\\WinInst\\Install.exe</strong></li> <li>If you're going to immediately upgrade to a newer version you may upgrade workstations after the server has been upgraded to a more recent version</li> </ul> </li> </ol> <p>&nbsp;</p> <p>&nbsp;</p> <div class=\"col-xs-12 col-sm-7\">\n<h4>Need more help?</h4>\n<p style=\"margin-bottom: 24px;\"><a id=\"limitless-url\" class=\"btn btn-primary\" style=\"color: white; background-color: black; border: black; border-radius: 24px; margin-top: 8px; width: 40%;\" rel=\"noopener\" href=\"https://www.sage300construction.com/chat\" target=\"_blank\">Chat now</a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div> <p><br><br><br></p> <p>&nbsp;</p>"
    },
    {
      "name": "Steps to duplicate",
      "content": ""
    },
    {
      "name": "Related Solutions",
      "content": "<p>[[What Sage 300 Construction and Real Estate and Sage Estimating files and folders should I exclude from my antivirus software scan?|222924150017258]]<br style=\"font-size: 14.6667px; letter-spacing: 0.2px;\">[[Sage 300 Construction and Real Estate and Sage Estimating Required Windows Permissions|222924350018211]]<br style=\"font-size: 14.6667px; letter-spacing: 0.2px;\">[[Sage 300 Construction and Real Estate Migration Information|222924650022043]]<br style=\"font-size: 14.6667px; letter-spacing: 0.2px;\">[[How to migrate macros|224924450059539]]<br style=\"font-size: 14.6667px; letter-spacing: 0.2px;\">[[Crypto - Starting with a fresh 9.5|225924150080264]]</p>"
    }
  ],
  "id": "222924350018500",
  "language": "English",
  "lastModifiedDate": 1689349128000,
  "minorModifiedDate": 1740166799000,
  "keywords": "migration manual-migration move",
  "question": null,
  "renewDate": 1847059200000,
  "solutionBoost": 1.0,
  "status": "Published",
  "type": "Template Solution",
  "taxonomy": [
    "Category//Installation//Download"
  ],
  "templateName": "1 - Support Article",
  "title": "How do I manually migrate/move Sage 300 CRE to another server?",
  "translations": [],
  "viewCount": 3174,
  "solvedCount": 141,
  "unsolvedCount": 0,
  "summary": "Steps to perform a manual migration of Sage 300 CRE.",
  "revisionID": null,
  "templateSolutionID": "PRE2156723"
}