{
  "author": "angie.gwalchmai@sage.com",
  "approver": "angie.gwalchmai@sage.com",
  "attributeSetName": null,
  "attributes": [],
  "categoryCode": "custom",
  "collections": [
    "custom_au_en_threehundredcre",
    "custom_ca_threehundred_construction",
    "custom_us_threehundred_construction",
    "custom_au_estimating",
    "custom_ca_estimating",
    "custom_us_estimating"
  ],
  "createDate": 1683037645000,
  "diagnosticResponses": [],
  "fields": [
    {
      "name": "Description",
      "content": ""
    },
    {
      "name": "Cause",
      "content": ""
    },
    {
      "name": "Resolution",
      "content": "<p><span class=\"ra-content-caution\" style=\"color: #b94a48;\"><img src=\"https://internal-kb.sage.com/portal/app/images/content_caution.gif\" alt=\"\" /> <strong>CAUTION:</strong> <span>This solution requires an advanced understanding of Windows or third-party add-ons. Mistakes in the Windows registry, security, and network settings can cause serious problems. Sage isn't responsible for the Windows environment, third-party add-ons, or customization issues. Create a system and database backup before making changes. Get help from your system admin, consultant, or vendor.</span></span>&nbsp;</p> <div id=\"dl-initialquestionstohelpisolateareasoffocus1554\" class=\"expand-collapse\"><a href=\"#\" data-toggle=\"collapse\" data-target=\"#ec-1752094242483\"><em class=\"icon-arrow-up\"></em><em class=\"icon-arrow-down\"></em><span>Initial questions to help isolate areas of focus</span></a> <div id=\"ec-1752094242483\" class=\"collapse\" style=\"height: auto;\"> <h3>Initial questions to help isolate areas of focus</h3> <ul> <li>Exactly where, when, and for whom does the slowness appear? <ul> <li>During initial login?</li> <li>Before the appearance of the Logon window?</li> <li>After Logon and before the Company List?</li> <li>After selecting a Company?</li> <li>Specific applications?</li> <li>Specific tasks or reports?</li> <li>Specific company data folders?</li> <li>Specific workstations?</li> <li>Specific terminal servers?</li> <li>Everywhere except for the file server?</li> <li>Everywhere including the file server?</li> <li>Specific users?</li> <li>Only in CRE 300 Applications or in all programs on the computers?</li> <li>Performance tab of task manager, how much ram is free?</li> </ul> </li> <li>Is your slowness consistently reproducible or sporadic/random in nature?</li> <li>Chronologically speaking, when did your slowness begin to appear?</li> <li>Describe the nature of the slowness with as much detail as possible. Indicating the actual time to complete compared with the expected or previous time to complete</li> <li>When did you last reboot the server?</li> <li>Is there a restart schedule for the server and terminal servers?</li> <li>When did you last reboot the workstation?</li> <li>Are you collecting backups while users are actively working? Shadow copy? Pervasive/Actian Backup Agent? VM Backups or Replications? Other?</li> <li>Is Record Security or File Security enabled in CRE 300 Security Administration?</li> <li>Have there been any changes between when it wasn’t slow and now? <ul> <li>Upgrade? <ul> <li>Current CD Version, Revision, and Update?</li> <li>Prior CD Version, Revision, and Update?</li> </ul> </li> <li>Migration?</li> <li>New software?</li> <li>New hardware?</li> <li>Recent virus or malware infestation: Even if you've cleaned the virus, damage or infection can exist</li> <li>Recent crashes?</li> <li>Windows updates?</li> <li>Antivirus/Antimalware updates or changes?</li> <li>More network protocols?</li> </ul> </li> <li>If you perform the same steps in a test environment/sample data, do you get the same results?</li> <li>Is your server low on drive space?</li> <li>Is your workstation low on drive space?</li> <li>If you install Sage products on a new computer or newly formatted drive, is the performance still slow? <ul> <li>Correct method to install Sage products for troubleshooting a new/newly formatted computer: <ol> <li>Clean install of the operating system</li> <li>Don’t start installing all your other software such as antivirus, etc.</li> <li>Don't join the computer to the domain if domain policies install Windows updates or other software automatically</li> <li>Instead, install Sage products to verify if the performance issues are present or not</li> <li>If no issues occur, continue with the installation of other software, joining the computer to the domain, etc.</li> <li>Monitor each step to identify if a specific software, Windows update, or group policy causes performance issues</li> </ol> </li> </ul> </li> <li>Is the Log Viewer file over 2GB in size? Located in the C:\\ProgramData\\Sage\\TIMBERLINE OFFICE\\9.5\\ACCOUNTING\\Global\\PVData\\master_qlm folder on the server <ul> <li>Interfacing 3rd-party programs can constantly write entries to the log, causing the QLM file to grow quickly</li> <li>Archive or move the Log Viewer when it approaches 2GB in size</li> </ul> </li> </ul> <p>If you still can’t isolate the cause for slow performance issues after completing these steps, contact Sage Support for assistance. Have your answers to the questions above ready when you contact support. Have both your IT professional and the main affected user on the call. Performance issues can take much time and resources to identify the root cause.</p> </div> </div> <p class=\"expand-collapse-p-tag\">&nbsp;</p> <div id=\"dl-twomaincausesofperformanceissues1501\" class=\"expand-collapse\"><a href=\"#\" data-toggle=\"collapse\" data-target=\"#ec-1752094263694\"><em class=\"icon-arrow-up\"></em><em class=\"icon-arrow-down\"></em><span>Two main causes of performance issues</span></a> <div id=\"ec-1752094263694\" class=\"collapse\" style=\"height: auto;\"> <h3>Two main causes of performance issues</h3> <h4>Antivirus or other anti-malware security software actively scanning the data or software</h4> <ul> <li>[[Why is Sage Estimating or Sage 300 CRE so slow?|223924350032849]]</li> <li>[[Sage 300 CRE and Sage Estimating antivirus exclusions|222924150017258]]</li> </ul> <h4>The Log Viewer file is over 2GB in size</h4> <ul> <li>Located in the C:\\ProgramData\\Sage\\TIMBERLINE OFFICE\\9.5\\ACCOUNTING\\Global\\PVData\\master_qlm folder on the server</li> </ul> <h5>Archive the log</h5> <p>See [[instructions on archiving the Log Viewer|222924450019543]].</p> <p>If the log is too large to archive, you can [[move the master.qlm file using the File Tools function|222924150017216]]. When selecting the master.qlm file in File Tools, you’ll need to browse to the Global folder to locate it. See C:\\ProgramData\\Sage\\TIMBERLINE OFFICE\\9.5\\ACCOUNTING\\Global\\ on the server.</p> <h5>How to slow future growth</h5> <p>To slow the growth of the file, we recommend you turn off logging for the <strong>Security</strong> log type in the Log Settings. This will stop the recording of the log-in/out entries. Access the Log Settings with one of these methods:</p> <ul> <li>Sage Desktop, <strong>Common Tasks</strong>, <strong>Log Viewer</strong>, then click <strong>Settings</strong> from the toolbar</li> <li>Sage Desktop, <strong>Options</strong>, <strong>Security Administration</strong>, <strong>Log Settings</strong></li> </ul> </div> </div> <p class=\"expand-collapse-p-tag\">&nbsp;</p> <div id=\"dl-otherreasonsforperformanceissues1206\" class=\"expand-collapse\"><a href=\"#\" data-toggle=\"collapse\" data-target=\"#ec-1752094302545\"><em class=\"icon-arrow-up\"></em><em class=\"icon-arrow-down\"></em><span>Other reasons for performance issues</span></a> <div id=\"ec-1752094302545\" class=\"collapse\" style=\"height: auto;\"> <h3>Other reasons for performance issues</h3> <ul> <li>Invalid company references in the CPL file (contact Sage Support for assistance)</li> <li>Replicator instance name file in MISC folder if you don’t use Replicator</li> <li>Your Sage log viewer is large (2GB+ in size) and you're using Sage MyAssistant. You have tasks set to run <strong>\"At the conclusion of a Sage 300 CRE program\"</strong> <ul> <li>See [[Starting the MyAssistant ISDAdminTaskService slows the entire server|222924450019542]]</li> </ul> </li> <li>Your antivirus or anti-malware applications don't catch malware or virus infections <ul> <li>[[Slow performance in Sage products (incorrect network adapter duplex settings)|223924350033869]]</li> <li>[[How do I use the PING command to troubleshoot network connectivity or slowness?|223924250031213]]</li> </ul> </li> <li>Hard drive failure or imminent failure (that is, the hard drive going bad). Contact your IT professional for assistance. See [[Slow Performance in Sage 300 Construction and Real Estate or Sage Estimating (hard drive failure imminent)|224924550061349]] <ul> <li>Symptoms include <ul> <li>Windows Explorer lagging or not responding</li> <li>Icons and files/folders taking a long time to display</li> <li>Corrupt files (CRC errors)</li> <li>Windows complaining about SMART errors, BIOS errors, or POST SMART errors[[|224924550061349]]</li> </ul> </li> </ul> </li> <li>The machine doesn’t meet minimum requirements, or meets requirements but has the additional load of performing other tasks <ul> <li>Your machine meets minimum requirements, but you installed other applications that tax the processor, RAM, or hard disks. The minimum requirements no longer apply when this occurs</li> <li>Keep in mind the minimum requirements are just the bare minimum. If the machine is performing other tasks, you need computers that meet or exceed the recommended specifications</li> <li>[[Slow performance for Sage products (Sage 100, Sage 300, Sage Estimating - computer doesn't meet requirements)|224924550061353]]</li> <li>See requirements listed in the <a rel=\"noopener\" href=\"http://cdn.na.sage.com/SageMail/zCREDocs/CREDocs.html\" target=\"_blank\">installation or user guides</a></li> </ul> </li> <li>Incorrect workflow used during the Sage 300 server migration</li> <li>Incorrect workflow used to delete company folders</li> <li>The server crashed before migration <ul> <li>See [[Slow performance of Sage 300 Construction and Real Estate after migration|222924850025496]]</li> </ul> </li> <li>If the slowness only affects one/few of your reports, the report design could cause the issue. For example, how the report accesses and sorts data <ul> <li>Contact the person who originally customized the report for assistance troubleshooting the report design</li> </ul> </li> <li>If the slowness only affects some tasks for an application, see if that application uses custom forms. Update the form path to use the current UNC path <ul> <li>Example: Accounts Receivable, Enter Cash Receipts - If it's slow to open, update the path to the receipts journal <ol> <li>Go to Accounts Receivable, File, Company Settings, AR Settings, Forms and Journals.</li> <li>Use the current UNC path to the report file.</li> </ol> </li> </ul> </li> <li>The Sage Event Log can function incorrectly <ul> <li>You can access through the Windows Event Viewer to verify if there are recent entries</li> <li>Background Tasks and other Sage processes can function poorly or not at all if this log doesn't update correctly</li> </ul> </li> <li>You recently had a power outage <ul> <li>See [[Licensing not working after server power loss, critical failure, or hard reset|221924460115751]]</li> </ul> </li> </ul> </div> </div> <p class=\"expand-collapse-p-tag\">&nbsp;</p> <p>&nbsp;</p> <p>&nbsp;</p> <p>&nbsp;</p> <div class=\"col-xs-12 col-sm-7\">\n<h4>Need more help?</h4>\n<p style=\"margin-bottom: 24px;\"><a id=\"limitless-url\" class=\"btn btn-primary\" style=\"color: white; background-color: black; border: black; border-radius: 24px; margin-top: 8px; width: 40%;\" rel=\"noopener\" href=\"https://www.sage300construction.com/chat\" target=\"_blank\">Chat now</a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div> <p><br><br></p> <p>&nbsp;</p>"
    },
    {
      "name": "Steps to duplicate",
      "content": ""
    },
    {
      "name": "Related Solutions",
      "content": "<p style=\"letter-spacing: 0.2px;\">[[Issues caused by a large Log Viewer file (QLM)|220924160100808]]</p> <p style=\"letter-spacing: 0.2px;\">[[Sage System Verifier fails on Windows Event Log Sources|230515160417507]]</p>"
    }
  ],
  "id": "224924550061331",
  "language": "English",
  "lastModifiedDate": 1752094449000,
  "minorModifiedDate": 1752094449000,
  "keywords": "Performance EST 300CRE",
  "question": null,
  "renewDate": 1847145600000,
  "solutionBoost": 1.0,
  "status": "Published",
  "type": "Template Solution",
  "taxonomy": [
    "Category//Performance//Connectivity//Product"
  ],
  "templateName": "1 - Support Article",
  "title": "Troubleshoot slow performance in Sage 300 CRE and Sage Estimating",
  "translations": [],
  "viewCount": 4690,
  "solvedCount": 245,
  "unsolvedCount": 2,
  "summary": "How do I troubleshoot slowness in the Sage 300 CRE and Estimating programs.",
  "revisionID": null,
  "templateSolutionID": "PRE2165885"
}