{
  "author": "jesse.gordon@sage.com",
  "approver": "angie.gwalchmai@sage.com",
  "attributeSetName": null,
  "attributes": [],
  "categoryCode": "custom",
  "collections": [
    "custom_au_en_threehundredcre",
    "custom_ca_threehundred_construction",
    "custom_us_threehundred_construction"
  ],
  "createDate": 1683051522000,
  "diagnosticResponses": [],
  "fields": [
    {
      "name": "Description",
      "content": "<div style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\"></div>"
    },
    {
      "name": "Cause",
      "content": "<div style=\"font-family: Arial, Verdana, sans-serif; font-size: 14px;\"></div>"
    },
    {
      "name": "Resolution",
      "content": "<h3>1. Post entries</h3> <ol> <li>Go to <strong>Cash Management</strong>, <strong>Tasks</strong>, <strong>Post Entries</strong>.</li> <li>Review the posting journal for issues to resolve.</li> <li>Go to <strong>General Ledger</strong>, <strong>Tasks</strong>, <strong>Post Entries</strong>.</li> <li>Review the posting journal for issues to resolve.</li> </ol> <h3>2. Verify the Bank Statement Ending Balance</h3> <ol> <li>Go to <strong>Cash Management</strong>, <strong>Reports</strong>, <strong>Reconciliation</strong>, <strong>Bank Reconciliation</strong>.</li> <li>Select only the&nbsp;<strong>CM Register (Register)</strong> file.</li> <li>Click&nbsp;<strong>OK</strong>.</li> <li>Enter the&nbsp;<strong>Statement Date</strong>&nbsp;of the last bank statement reconciled for this bank.</li> <li>Click&nbsp;<strong>Ranges</strong> and select the bank account.</li> <li>Click <strong>OK</strong>.</li> <li>Click&nbsp;<strong>Print Preview</strong> and review the report.</li> <li>Confirm the <strong>Bank Statement Ending Balance</strong> matches the bank statement.</li> <li>If the balance doesn’t match: <ol> <li>Rerun the report on the period before and work back to locate the first out of balance period.</li> <li>Confirm the list of outstanding items shows only transactions that haven’t cleared as of the statement date. If there are transactions that you don't want outstanding, see [[why a Reconciled Item shows as Outstanding|222924950027437]].<br><strong>Note:</strong>&nbsp; You can void checks using a date other than the original check date. Reconcile voided checks in the same statement period as the void date.</li> <li>See [[how to fix balances that are incorrect because of the Cleared Date or Statement Date|223924650038934]].</li> <li>If the same variances exist on earlier reports, [[verify Cash Management balances to itself|222924650022089]].</li> <li>See [[how to fix balances that are incorrect due to reconciled items that didn't clear the bank|224924250053413]].</li> </ol> </li> </ol> <h3>3. Verify the Adjusted Bank Balance matches the Register Balance as of Statement Date</h3> <ol> <li>If the <strong>Adjusted Bank Balance</strong> matches the <strong>Register Balance as of Statement Date</strong>, go to section 4.</li> <li>If the <strong>Adjusted Bank Balance</strong> doesn't match the <strong>Register Balance as of Statement Date</strong>: <ol> <li>Perform [[these steps to reconcile Cash Management to Cash Management|222924650022089]].</li> <li>Run the <strong>Bank Reconciliation</strong> report.</li> <li>Verify the <strong>Adjusted Bank Balance</strong> and the <strong>Register Balance as of Statement Date</strong> match. <ul> <li>If they don’t match, see the <strong>More Troubleshooting</strong> section below</li> <li>If they do match, proceed to Step 4 and compare the balance to GL</li> </ul> </li> </ol> </li> </ol> <h3>4. Compare the Register Balance to General Ledger</h3> <ol> <li>Note the <strong>Register Balance as of Statement Date</strong> on the <strong>Bank Reconciliation</strong> report.</li> <li>Go to <strong>General Ledger</strong>, <strong>Reports</strong>, <strong>Year-to-Date Ledger</strong>.</li> <li>Check the <strong>Modify Date Range</strong> box.</li> <li>Enter the <strong>Start date</strong> and <strong>End date</strong> for the period.</li> <li>Click <strong>Ranges</strong> and select the bank’s GL cash accounts.</li> <li>Click <strong>Start</strong> or <strong>Print Preview</strong> and review the report.</li> <li>Note the <strong>Ending Balance</strong> on the GL cash accounts.</li> <li>Compare the <strong>Ending Balance</strong> to the <strong>Register Balance as of Statement Date</strong> on the <strong>Bank Reconciliation</strong> report.</li> </ol> <h4>Balances match</h4> <p>If the GL cash account’s <strong>Ending Balance</strong> and the <strong>Register Balance as of Statement Date</strong> match, STOP HERE. General Ledger and Cash Management are in balance for this statement period. You’re finished with these steps.</p> <h4>Balances don’t match</h4> <p>If the GL cash account’s <strong>Ending Balance</strong> and the <strong>Register Balance as of Statement Date</strong> don’t match:</p> <ol> <li>Is there a <strong>Register Balance Adjusted for Future Voids</strong> balance that prints on the report? <ul> <li>If yes, inspect the <strong>Void Dates</strong> of the voided items on the <strong>Bank Reconciliation</strong> report: <ol> <li>If the <strong>Void Date</strong> is after the <strong>Statement Date</strong>, then it’s considered a “future void”.</li> <li>If the <strong>Void Date</strong> is on or before the <strong>Statement Date</strong>, then it isn't a “future void”. You need to reconcile the item.&nbsp;See [[Register Balance Adjusted for Future Period Voids can be incorrect on the Bank Reconciliation report|222924850025255]].</li> <li>If the <strong>Register Balance Adjusted for Future Voids</strong> matches the GL cash account's <strong>Ending Balance</strong>, STOP HERE. General Ledger and Cash Management are in balance for this statement period. You’re finished with these steps.</li> </ol> </li> <li>No balance prints. Or the <strong>Register Balance Adjusted for Future Voids</strong> doesn’t match the GL cash account’s <strong>Ending Balance</strong>: <ol> <li>See [[Bank Reconciliation report balances are off by voided checks|223924650038281]].</li> <li>After correcting the future voided items, verify the balances.</li> <li>If the <strong>Register Balance Adjusted for Future Voids</strong> matches the GL cash account’s <strong>Ending Balance</strong>, STOP HERE. General Ledger and Cash Management are in balance for this statement period. You’re finished with these steps.</li> </ol> </li> </ul> </li> <li>Run the <strong>Bank Reconciliation</strong> report for prior periods to identify the first period the <strong>Register balance</strong> matches: <ol> <li>If the following is true, go to step 1 of <strong>More&nbsp;Troubleshooting</strong>: <ul> <li><strong>Adjusted Bank Balance</strong>&nbsp;doesn’t match the&nbsp;<strong>Register Balance as of Statement Date</strong></li> </ul> </li> <li>If the following is true, go to step 2 of <strong>More&nbsp;Troubleshooting</strong>: <ul> <li><strong>Bank Statement Ending Balance</strong> doesn’t match the actual bank statement for that statement period</li> </ul> </li> <li>If the following is true, go to step 3 of <strong>More&nbsp;Troubleshooting</strong>: <ul> <li><strong>Bank Statement Ending Balance</strong> matches the actual bank statement for that statement period</li> <li><strong>Adjusted Bank Balance</strong> matches the <strong>Register Balance as of Statement Date</strong>&nbsp;</li> <li>Balances don’t match the GL cash account’s <strong>Ending Balance</strong> on the <strong>YTD Ledger</strong></li> </ul> </li> </ol> </li> </ol> <h3>More Troubleshooting</h3> <p><strong>Important:</strong> The following steps are complex. Contact your Sage Consultant if you need assistance.</p> <h4>Adjusted Bank Balance doesn’t match the Register Balance as of Statement Date</h4> <ul> <li>[[The item's Cleared date is before the Reference date|222924850025387]]</li> <li>[[Items have a Cleared status instead of a Reconciled status|223924450036153]]</li> <li>[[The Payroll accounting date uses the Period End Date|222924850025141]]</li> <li>[[A reconciled transaction has a future date|223924250030443]]</li> </ul> <h4>Bank Statement Ending Balance doesn’t match the actual bank statement</h4> <ul> <li>[[An item that cleared the bank is open|224924350057297]]</li> <li>[[A reconciled item didn't clear the bank|224924250053413]]</li> <li>[[An entry has an incorrect Cleared Date and/or Statement Date|223924650038934]]</li> <li>[[An item that cleared the bank was deleted|224924750070860]]</li> </ul> <h4>Cash Management has correct balances, but they don't match General Ledger</h4> <p>Cash Management balances</p> <ul> <li>Adjusted Bank Balance</li> <li>Register Balance as of Statement Date</li> <li>Register Balance Adjusted for Future Voids</li> </ul> <p>General Ledger balances</p> <ul> <li>The cash account's Ending Balance on the YTD Ledger</li> </ul> <p>Solutions</p> <ul style=\"font-size: 14.6667px; letter-spacing: 0.2px;\"> <li>[[What could cause the Cash Management and the General Ledger to be out of balance?|223924850044147]]</li> <li>[[How do I reconcile Cash Management to General Ledger? (By Transaction or Batch)|222924450019197]]</li> </ul> <div class=\"col-xs-12 col-sm-7\"> <p style=\"margin-bottom: 8px;\">&nbsp;</p> <p style=\"margin-bottom: 8px;\">&nbsp;</p> </div> <p>&nbsp;</p> <div class=\"col-xs-12 col-sm-7\"> <h4>Need more help?</h4> <p style=\"margin-bottom: 8px;\"><a id=\"limitless-url\" class=\"btn btn-primary\" style=\"color: white; background-color: black; border: black; border-radius: 24px; margin-top: 8px; width: 40%;\" rel=\"noopener\" href=\"https://www.sage300construction.com/chat\" target=\"_blank\">Chat now</a></p> </div> <p><br><br><br></p> <p>&nbsp;</p>"
    },
    {
      "name": "Steps to duplicate",
      "content": ""
    },
    {
      "name": "Related Solutions",
      "content": "<p>[[Can the CM Bank Account Balance Verification report be ran for one bank instead of all of them?|220924460106085]]</p> <p>[[How does an Accounts Payable check with a void date in the future affect my Cash Management reconciliation to General Ledger?|222924250017971]]</p> <p>[[Bank Account balances are incorrect|223924150027858]]</p> <p>[[The Adjusted Bank Balance is incorrect on the Cash Management Bank Reconciliation report (Bank Reconciliation in progress)|224924750070625]]</p>"
    }
  ],
  "id": "224924650064702",
  "language": "English",
  "lastModifiedDate": 1689363194000,
  "minorModifiedDate": 1752530664000,
  "keywords": "CM GL Rec reconcile-GL-CM CM-bank-reconciliation",
  "question": null,
  "renewDate": 1847145600000,
  "solutionBoost": 3.0,
  "status": "Published",
  "type": "Template Solution",
  "taxonomy": [
    "Category//Transactions//Bank//Reconciliation"
  ],
  "templateName": "1 - Support Article",
  "title": "Reconciling the Cash Management Bank Reconciliation Report and General Ledger",
  "translations": [],
  "viewCount": 3978,
  "solvedCount": 318,
  "unsolvedCount": 0,
  "summary": "Recommended process to reconcile bank accounts in Cash Management to the bank statement and to General Ledger in Sage 300 CRE.",
  "revisionID": null,
  "templateSolutionID": "PRE2166389"
}