{
  "author": "LegacyAuthorUS",
  "approver": "angie.gwalchmai@sage.com",
  "attributeSetName": null,
  "attributes": [],
  "categoryCode": "custom",
  "collections": [
    "custom_au_en_threehundredcre",
    "custom_ca_threehundred_construction",
    "custom_us_threehundred_construction"
  ],
  "createDate": 1664885018000,
  "diagnosticResponses": [],
  "fields": [
    {
      "name": "Description",
      "content": ""
    },
    {
      "name": "Cause",
      "content": ""
    },
    {
      "name": "Resolution",
      "content": "<strong>Creating a backup</strong></p> <ol> <li>Have all users close all Sage applications.</li> <li>Close all third-party applications that may access Sage 300 CRE data.</li> <li>Log in to the Sage 300 CRE file server as an administrator.</li> <li>From the Windows <strong>Start </strong>menu, launch <strong>System Administrator</strong>. <ul style=\"list-style-type: circle;\"> <li>Default local path on the server: C:\\Program Files (x86)\\Timberline Office\\Shared\\SystemAdministrator.exe</li> </ul> </li> <li>Log in as a Sage Application Administrator.</li> <li>If you use Sage SQL Replicator, click <strong>Connect</strong>, otherwise, click <strong>Cancel</strong>.</li> <li>Select <strong>Backup </strong>from the left navigation menu.</li> <li>Select the <strong>Backup </strong>checkbox in front of each company in the grid that you want to include in the backup file.</li> <li>On each line item, select whether to backup <strong>All </strong>or <strong>Data only </strong>files.<br><strong><span class=\"ra-content-note-3\" style=\"color: #468847;\"><span class=\"mceNonEditable\"><img class=\"ra-att-img\" src=\"https://internal-kb.sage.com/portal/app/images/content_note.gif\" alt=\"\">&nbsp;<strong class=\"ra-att-title\">NOTE:</strong>&nbsp;</span></span></strong><span class=\"ra-content-note-3\" style=\"color: #468847;\"><span class=\"ra-att-desc\"></span></span><span class=\"ra-content-note-3\" style=\"color: #468847;\"><span class=\"ra-att-desc\"><strong>Data only</strong> backups do not back up any file types in the data folder such as xls, pdf, prn, doc, txt, csv, or other non-pervasive related files. </span></span> [[System Administrator Backup tool excludes extended data files when the Data Only option is selected|220924960112037]].</li> <li>If you want to include other folders outside of the company folder for backup, select <strong>Add Folder </strong>or <strong>Add File </strong>and browse to the location of that folder or file.<br><strong>Note: </strong>The backup utility will not back up empty folders.</li> <li>Select a backup location in the <strong>Select the folder to store the backed-up data</strong> field.</li> <li>Check the option <strong>Automatically back up every day at</strong>&nbsp;and select a time if you want to run this daily.</li> <li>Click <strong>Save Configuration </strong>to save the backup settings for later use.</li> <li>Click <strong>Back up Now</strong>.</li> </ol> <p><strong>&nbsp; &nbsp; The backup creates a zip file with the following contents:</strong></p> <ul> <li>Pervasive data folders for the company(s) you selected to backup</li> <li>The SQL database (if you are replicating data)</li> <li>Sage\\Timberline Office\\9.5 folder (without the Wininst folder)</li> <li>Any additional folders or files you selected to backup</li> <li>Log files with backup information</li> </ul> <p><strong>Restoring a backup</strong></p> <ol> <li>Log in to the Sage 300 CRE file server as an administrator.</li> <li>From the Windows <strong>Start </strong>menu, launch <strong>System Administrator</strong>. <ul style=\"list-style-type: circle;\"> <li>Local path on the server: C:\\Program Files (x86)\\Timberline Office\\Shared\\SystemAdministrator.exe</li> </ul> </li> <li>Log in as a Sage Application Administrator.</li> <li>If you use Sage SQL Replicator, click <strong>Connect</strong>, otherwise, click <strong>Cancel</strong>.</li> <li>From the left navigation menu, select <strong>Restore</strong>.</li> <li>Click <strong>Browse </strong>to navigate to the location of your backup. The backup file name will be formatted as <strong>backup _ .zip </strong>.</li> <li>Confirm the backup contains the data folder(s) you want to restore, then click <strong>Restore</strong>.</li> <li>Click the <strong>I accept the risks associated with restoring my data </strong>check box.</li> <li>Click <strong>Next</strong>.</li> <li>Select the scenario that matches the reason you are restoring your data and continue the steps.</li> </ol> <ul> <li> <div class=\"expand-collapse\"><a class=\"collapsed\" href=\"#\" data-toggle=\"collapse\" data-target=\"#ec-1696976096663\" aria-expanded=\"false\"><em class=\"icon-arrow-up\"></em><em class=\"icon-arrow-down\"></em><span>&nbsp; <strong>Scenario 1 - Restoring a data folder to replace the current live data</strong></span></a> <div id=\"ec-1696976096663\" class=\"collapse\" style=\"height: 0px;\" aria-expanded=\"false\"> <ul> <li>Restoring only the Pervasive folder to the current live location</li> <li>Restoring both the Pervasive and SQL folders to the current live location</li> <li>Restoring the complete system files to the current live location</li> </ul> <p>&nbsp;</p> <ol> <li>Select the data folder(s) you want to restore by selecting the <strong>Restore Folder </strong>checkbox in front of each folder.</li> <li>Verify the <strong>Restore path </strong>displayed is the correct path for the live data folder(s). If it is not, use the <strong>Browse </strong>button to navigate to the new location.</li> <li>If you are replicating your data into SQL, select <strong>Restore SQL </strong>to restore your SQL data.<br><strong>Caution: </strong>You will lose any attachments saved using Mobile Projects between now and the time of the backup you are restoring. Restoring only the Pervasive data will remove any records created between now and the backup date. Those attachments will disassociate from the original record created in the interim.<br><strong>Tip:</strong> If you check the Restore folder checkbox, the SQL checkbox will automatically become checked. If you decide to uncheck the Restore folder box for a specific data folder, you will need to uncheck the Restore SQL box manually.</li> <li>If you need to fully restore the 9.5 folder (global security, reports, formulas, report menus, etc.), check the box to <strong>Restore Global folders</strong>.</li> <li>Click <strong>Next </strong>and verify that Restore is performing the expected actions for the folder(s) you chose.</li> <li>Select Next and acknowledge the warning message regarding data overwrite.<br><span class=\"ra-content-note-1\" style=\"color: #468847;\"><span class=\"mceNonEditable\"><img class=\"ra-att-img\" src=\"https://internal-kb.sage.com/portal/app/images/content_note.gif\" alt=\"\">&nbsp;<strong class=\"ra-att-title\">NOTE:</strong>&nbsp;</span><span class=\"ra-att-desc\">If you have selected to restore to the same location, it will rename the pervasive folder in that location and copy the restored folder into its place. The renamed folder will include the original folder name appended with the date and time of the restore operation. The same rename operation and naming convention will be performed on the SQL database(s).</span></span></li> <li>The <strong>Restore </strong>will stop replication on all data folders, then proceed to rename the folder(s) in the current location and replace the folder(s) with the backup.</li> <li>After the operation is complete, select <strong>Replication </strong>from the menu and ensure it replicates all databases. The <strong>Replicating </strong>field should be set to <strong>Yes</strong>.</li> <li>After the restore is complete, you should open each restored folder in Sage 300 CRE and verify your data.</li> </ol> </div> </div> <p>&nbsp;</p> </li> <li class=\"expand-collapse\"><a href=\"#\" data-toggle=\"collapse\" data-target=\"#ec-1696976224366\" aria-expanded=\"true\"><em class=\"icon-arrow-up\"></em><em class=\"icon-arrow-down\"></em><span><strong>Scenario 2 - Restoring the data folder to a different location for purposes of testing or archiving</strong></span></a> <div id=\"ec-1696976224366\" class=\"in collapse\" style=\"height: auto; border: 1px dashed gray;\" aria-expanded=\"true\"> <ol> <li>From the Sage Desktop <strong>Options </strong>menu, select <strong>New Company </strong>and create a new company for the restored data.</li> <li>Select the data folder(s) you want to restore by selecting the <strong>Restore Folder </strong>checkbox in front of each folder.</li> <li>Use the <strong>Browse </strong>button to navigate to the new location created in step 1 above.</li> <li>Clear the checkbox <strong>Restore SQL</strong>.<br><strong>Important: </strong>Leaving the “Restore SQL” checkbox checked will cause the SQL database in the current location to be associated with the Pervasive folder in the new location. You should ensure that this checkbox is unchecked unless you want to have the new Pervasive folder location become the ‘live’ data location.</li> <li>If you need to fully restore the 9.5 folder (global security, reports, formulas, report menus, etc.), check the box to Restore Global folders.<br><strong>Note</strong>: This will affect all company folders, including your live data. This is not required for reporting or testing purposes.</li> <li>Click <strong>Next </strong>and verify that the Restore is performing the expected actions for the folder(s) you have chosen. Verify the new location is correct and whether you expect to restore the SQL data.</li> <li>Select <strong>Next </strong>and acknowledge the warning message regarding data overwrite.</li> <li>The <strong>Restore </strong>will stop replication on all data folders, then proceed to copy the data folder(s) you selected to the new location. <span class=\"ra-content-note-2\" style=\"color: #468847;\"><span class=\"mceNonEditable\"><img class=\"ra-att-img\" src=\"https://internal-kb.sage.com/portal/app/images/content_note.gif\" alt=\"\">&nbsp;<strong class=\"ra-att-title\">NOTE:</strong>&nbsp;</span><span class=\"ra-att-desc\">Suppose you have selected to restore the SQL data as well. In that case, it renames the original folder in the SQL database, creates a database with the same name and associates it with the new location for the Pervasive data.</span></span></li> <li>After the operation is complete, select <strong>Replication </strong>from the menu and ensure it replicates all databases. The <strong>Replicating </strong>field should be set to <strong>Yes</strong>.</li> <li>After the restore is complete, you should open each restored folder in Sage 300 CRE and verify your data.</li> <li>If you are restoring to a new location to create a copy of your company data for testing or archiving do the following to ensure correct naming for these copied folders: <ol> <li>Open Sage 300 CRE and use click <strong>Specify Folders </strong>to browse to the path of the new company folder. Select and open the new folder</li> <li>From the Desktop <strong>Common Tasks </strong>menu, select <strong>File</strong>, <strong>Company Settings</strong>, and <strong>General</strong>. Rename the new folder in the Company name field and the <strong>Data folder Description </strong>field if you haven’t already. Select <strong>Okay </strong>and close. This ensures that this data folder has a unique name and is distinguished as a unique company. It will also ensure that Sage Replicator uses a unique name if you choose to replicate this new folder.</li> <li>If you do not want the folder to display in Open Company after you have performed the prior steps, you can remove the company from the list by selecting <strong>Remove from List </strong>on the Open Company window.</li> </ol> </li> <li>If you determine that you would like to replicate this new folder in SQL: <ol> <li>Open the System Administrator window.</li> <li>Select the newly renamed company.</li> <li>Follow the process to begin replication.</li> </ol> </li> </ol> <p>&nbsp;</p> </div> </li> </ul> <p>&nbsp;</p> <p>&nbsp;<br> <br><div class=\"col-xs-12 col-sm-7\">\n<h4>Need more help?</h4>\n<p style=\"margin-bottom: 24px;\"><a id=\"limitless-url\" class=\"btn btn-primary\" style=\"color: white; background-color: black; border: black; border-radius: 24px; margin-top: 8px; width: 40%;\" rel=\"noopener\" href=\"https://www.sage300construction.com/chat\" target=\"_blank\">Chat now</a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div><br><br><br><br><br><br><br><br><br><br><br><br>"
    },
    {
      "name": "Steps to duplicate",
      "content": ""
    },
    {
      "name": "Related Solutions",
      "content": "<p>[[﻿Using the System Administrator to back up and restore your data (video)|225924350085272]]</p>"
    }
  ],
  "id": "225924350086066",
  "language": "English",
  "lastModifiedDate": 1664885018000,
  "minorModifiedDate": 1707653466000,
  "keywords": "backup",
  "question": null,
  "renewDate": 1715385600000,
  "solutionBoost": 1.0,
  "status": "Published",
  "type": "Template Solution",
  "taxonomy": [
    "Category//Data//Backup or restore data"
  ],
  "templateName": "1 - Support Article",
  "title": "How do I use the System Administrator to back up and restore data?",
  "translations": [],
  "viewCount": 4800,
  "solvedCount": 155,
  "unsolvedCount": 1,
  "summary": "In this article, we provide the steps to create an automatic backup using the System Administrator (in versions 17.1 and later). We also provide the steps to restore the backup, following a couple of common scenarios as guides.",
  "revisionID": null,
  "templateSolutionID": "PRE2169383"
}