{
  "author": "angie.gwalchmai@sage.com",
  "approver": "angie.gwalchmai@sage.com",
  "attributeSetName": null,
  "attributes": [],
  "categoryCode": "custom",
  "collections": [
    "custom_au_en_threehundredcre",
    "custom_ca_threehundred_construction",
    "custom_us_threehundred_construction"
  ],
  "createDate": 1689720526000,
  "diagnosticResponses": [],
  "fields": [
    {
      "name": "Description",
      "content": ""
    },
    {
      "name": "Cause",
      "content": "<p><span style=\"color: rgb(0, 0, 0); font-family: &quot;Times New Roman&quot;; font-size: medium; letter-spacing: normal; display: inline !important;\">Closed the fiscal year with an amount in suspense.</span></p>"
    },
    {
      "name": "Resolution",
      "content": "<span class=\"ra-content-caution\" style=\"color: #b94a48;\"><img src=\"https://internal-kb.sage.com/portal/app/images/content_caution.gif\" alt=\"\" /> <strong>CAUTION:</strong>&nbsp;</span><span style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><span style=\"color: #b94a48;\">Sage support can't assist with third-party products, hardware, report customizations, or state and federal tax questions. Refer to our </span>[[<span style=\"color: #0906fa;\">Scope of Support</span>|221924150011251]]<span style=\"color: #b94a48;\"> for more info. Contact your Sage business partner, network administrator, or accountant for assistance.</span></span><br></p><p style=\"color: #000000; font-family: 'Times New Roman'; font-size: medium; letter-spacing: normal;\">Entries post to a suspense account when General Ledger cannot determine the correct account number the entry should post to. This can occur when the General Ledger account number of a transaction does not exist, or the suspense account is used as an account in another application.</p><p style=\"color: #000000; font-family: 'Times New Roman'; font-size: medium; letter-spacing: normal;\"><strong>NOTE</strong>: Because suspense account amounts do not close to Retained Earnings when you close the year, your current ledger may be out of balance.</p><p style=\"color: #000000; font-family: 'Times New Roman'; font-size: medium; letter-spacing: normal;\">Follow the steps below to identify and correct prior year entries that have posted to a suspense account in General Ledger:<br><ol style=\"color: #000000; font-family: 'Times New Roman'; font-size: medium; letter-spacing: normal;\"> <li>Verify your General Ledger settings. <ol> <li>From the File menu, select&nbsp;<strong>Company Settings, GL Settings, Ledger Settings</strong>.</li> <li>On the&nbsp;<strong>Activity tab</strong>, verify that the&nbsp;<strong>Print references</strong>&nbsp;and&nbsp;<strong>Print batch numbers</strong>&nbsp;check boxes are selected. If not, select them.</li> <li>Click&nbsp;<strong>OK&nbsp;</strong>twice.</li> </ol> </li> <li>Print a ledger for your suspense account for the prior fiscal year as follows: <ol> <li>From the&nbsp;<strong>Reports&nbsp;</strong>menu, select the&nbsp;<strong>Year-to-date Ledger</strong>.</li> <li>Click&nbsp;<strong>Ranges&nbsp;</strong>and select the suspense account.</li> <li>Select the Modify date range check box.</li> <li>In the&nbsp;<strong>Start date</strong>&nbsp;box, type the beginning date of your prior fiscal year.</li> <li>In the&nbsp;<strong>End date&nbsp;</strong>box, type the ending date of your prior fiscal year.</li> <li>Click&nbsp;<strong>Start&nbsp;</strong>to print the ledger to a file or printer.</li> </ol> </li> <li>Use your ledger to identify the periods in which entries posted to your suspense account.</li> <li>Determine if a transaction record has an original account. <ol> <li>From the&nbsp;<strong>Inquiry&nbsp;</strong>menu, select&nbsp;<strong>Entries</strong>.</li> <li>Select&nbsp;<strong>Current&nbsp;</strong>and then click&nbsp;<strong>OK</strong>.</li> <li>Click&nbsp;<strong>Conditions</strong>.</li> <li>In the&nbsp;<strong>Field&nbsp;</strong>section, select&nbsp;<strong>Account</strong>.</li> <li>In the&nbsp;<strong>Operator&nbsp;</strong>section, select&nbsp;<strong>Equal&nbsp;</strong>to.</li> <li>In the&nbsp;<strong>Value&nbsp;</strong>section, type your suspense account number.</li> <li>Click&nbsp;<strong>OK</strong>&nbsp;twice.</li> <li>Click Select, select&nbsp;<strong>Add column after this column</strong>, and then click&nbsp;<strong>OK</strong>.</li> <li>Select&nbsp;<strong>Original Account</strong>&nbsp;and then click&nbsp;<strong>OK</strong>.</li> <li>Print the inquiry. Select the link below for steps to print an inquiry.</li> <li>Click&nbsp;<strong>Close</strong>.</li> </ol> </li> <li>If necessary, print batch reports, or review the account retrieval hierarchy in the application of origin to determine what these entries were and what accounts they should have posted to. Contact your Sage Timberline Office Consultant and/or accountant if you require assistance in determining the correct General Ledger account number.</li> <li>After you determine what accounts you want these entries to be in, record journal entries in General Ledger (Tasks, Record Entries) to reverse these entries from the suspense account and debit or credit the correct account as appropriate.<br><br><strong>Note</strong>: You may need to set&nbsp;<strong>Force Zero Proof</strong>&nbsp;to&nbsp;<strong>No&nbsp;</strong>in General Ledger settings if your entries cross different prefixes (<strong>File, Company Settings, GL Settings, Processing Options</strong>). If you set&nbsp;<strong>Force Zero Proof</strong>&nbsp;to&nbsp;<strong>No&nbsp;</strong>in General Ledger settings, always set the option back to the original setting after you make your entries. You may also need to open posting periods to post entries for prior periods which completely clear the activity in the suspense account. If you do not want to post to the original periods, you can create reversing entries to your suspense account using year-end accounting dates. However, this only corrects the suspense account as of the year-end accounting date you use and does not affect prior activity. Contact your Sage Timberline Office Consultant if you require assistance.</li> </ol><p style=\"color: #000000; font-family: 'Times New Roman'; font-size: medium; letter-spacing: normal;\">&nbsp;</p><ol style=\"color: #000000; font-family: 'Times New Roman'; font-size: medium; letter-spacing: normal;\" start=\"7\"> <li>If you closed your fiscal year with an amount in suspense, correct the Current balance and Future balance boxes for your suspense account. If you did not close your year with an amount in the suspense account, you are finished with this solution and do not need to proceed further.</li> <li>Correct the&nbsp;<strong>Current balance</strong>&nbsp;and&nbsp;<strong>Future balance</strong>&nbsp;boxes for your suspense account as follows: <ol> <li>Verify that you have already reversed all the appropriate activity in your suspense account according to step 6 above.</li> <li>Turn on&nbsp;<strong>Audit setup activity</strong>. See [[How do I use Audit setup activity?|222924150017021]]</li> <li>From the&nbsp;<strong>Setup&nbsp;</strong>menu, select&nbsp;<strong>Accounts</strong>.</li> <li>Click&nbsp;<strong>List</strong>, select your suspense account, and then click&nbsp;<strong>OK</strong>.</li> <li>Select the&nbsp;<strong>Balances (Accrual)&nbsp;</strong>or<strong>&nbsp;Balances (Cash)&nbsp;</strong>tab as appropriate.</li> <li>Delete the balances in the&nbsp;<strong>Current balance</strong>&nbsp;and&nbsp;<strong>Future balance</strong>&nbsp;boxes. If you are supposed to have a balance in the&nbsp;<strong>Current balance</strong>&nbsp;or&nbsp;<strong>Future balance</strong>&nbsp;boxes, edit the amounts as appropriate so that the correct balance remains.<br><strong>Example</strong>: You had a suspense account entry in December, closed your fiscal year, and then had an additional entry to suspense in March. In order to correct the December entry, record journal entries to reverse the December entry and then adjust the Current balance and Future balance boxes so that only the March amount remains.</li> <li>Click&nbsp;<strong>Save</strong>, and then click&nbsp;<strong>Close</strong>.</li> <li>Turn off&nbsp;<strong>Audit setup activity</strong>. See [[How do I use Audit setup activity?|222924150017021]]</li> </ol> </li> <li>If you posted your entries in Step 6 to prior year, use&nbsp;<strong>Tasks, Close Fiscal Year</strong> to close the amounts to Retained Earnings. See [[How do I close prior year adjustments to retained earnings?|222924250017502]]</li> </ol>"
    },
    {
      "name": "Steps to duplicate",
      "content": ""
    },
    {
      "name": "Related Solutions",
      "content": ""
    }
  ],
  "id": "230718224846090",
  "language": "English",
  "lastModifiedDate": 1689720526000,
  "minorModifiedDate": 1707652165000,
  "keywords": "GL",
  "question": null,
  "renewDate": 1847491200000,
  "solutionBoost": 1.0,
  "status": "Published",
  "type": "Template Solution",
  "taxonomy": [
    "Category//Transactions//Corrections"
  ],
  "templateName": "1 - Support Article",
  "title": "Fiscal Year was closed with an amount in a suspense account in General Ledger",
  "translations": [],
  "viewCount": 243,
  "solvedCount": 63,
  "unsolvedCount": 0,
  "summary": "There is a balance in a Suspense account from the prior year.",
  "revisionID": null,
  "templateSolutionID": "PRE229101"
}